{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "c80a68f2",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import pandas as pd\n",
    "from neo4j import GraphDatabase\n",
    "import json\n",
    "\n",
    "from dotenv import load_dotenv"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3e04c158",
   "metadata": {},
   "source": [
    "### 1. 서버와 연결"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "45f94362",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Wait 60 seconds before connecting using these details, or login to https://console.neo4j.io to validate the Aura Instance is available\n",
    "load_dotenv()\n",
    "\n",
    "NEO4J_URI = os.getenv(\"NEO4J_URI\") \n",
    "NEO4J_USERNAME = os.getenv(\"NEO4J_USERNAME\") \n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\") \n",
    "NEO4J_DATABASE = os.getenv(\"NEO4J_DATABASE\") \n",
    "AURA_INSTANCEID = os.getenv(\"AURA_INSTANCEID\") \n",
    "AURA_INSTANCENAME = os.getenv(\"AURA_INSTANCENAME\") \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "05dad1e6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j.api.ServerInfo object at 0x7f9c77da14e0>\n"
     ]
    }
   ],
   "source": [
    "driver = GraphDatabase.driver(NEO4J_URI, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))\n",
    "\n",
    "def close_driver():\n",
    "    driver.close()\n",
    "\n",
    "print(driver.get_server_info())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "fa570941",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'label': 'Keyword'}, {'label': 'Paper'}]\n",
      "[{'relationshipType': 'PREREQ'}, {'relationshipType': 'ABOUT'}, {'relationshipType': 'IN'}, {'relationshipType': 'REF_BY'}]\n",
      "[{'n': {'name': 'A priori probability', 'link': 'https://en.wikipedia.org/wiki/A_priori_probability', 'alias': ['a priori probability'], 'categories': ['A priori']}}, {'n': {'name': 'AC-3 algorithm', 'link': 'https://en.wikipedia.org/wiki/AC-3_algorithm', 'alias': ['ac-3', 'AC3', 'ac3', 'A C 3', 'ac 3'], 'categories': ['Constraint programming']}}, {'n': {'name': 'Abstract data type', 'link': 'https://en.wikipedia.org/wiki/Abstract_data_type', 'alias': ['abstract data type', 'ADT', 'abstract datatype', 'abstract data types', 'adt'], 'categories': ['Abstract data types', 'Data types', 'Type theory']}}, {'n': {'name': 'Abstract type', 'link': 'https://en.wikipedia.org/wiki/Abstract_type', 'alias': ['abstract type', 'AbstractType', 'abstract-type', 'abstract type definition', 'abstracttype'], 'categories': ['Type theory']}}, {'n': {'name': 'Adjusted mutual information', 'link': 'https://en.wikipedia.org/wiki/Adjusted_mutual_information', 'alias': ['AMI', 'adjusted mutual information', 'adjustedmi', 'ami', 'adjusted mutual info', 'adjustedmi score'], 'categories': ['Clustering criteria', 'Information theory']}}]\n"
     ]
    }
   ],
   "source": [
    "def run_cypher(query: str, params: dict | None = None):\n",
    "    session_args = {\"database\": NEO4J_DATABASE}\n",
    "\n",
    "    with driver.session(**session_args) as session:\n",
    "        result = session.run(query, params or {})\n",
    "        return [record.data() for record in result]\n",
    "\n",
    "# 그래프에 어떤 라벨이 있는지(노드 종류)\n",
    "print(run_cypher(\"CALL db.labels()\"))\n",
    "\n",
    "# 엣지 타입이 뭐가 있는지\n",
    "print(run_cypher(\"CALL db.relationshipTypes()\"))\n",
    "\n",
    "# 노드 5개 샘플 보기\n",
    "print(run_cypher(\"MATCH (n) RETURN n LIMIT 5\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "72627820",
   "metadata": {},
   "source": [
    "### 2. Load data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7487de89",
   "metadata": {},
   "outputs": [],
   "source": [
    "## 에이전트 팀에서json 구조를 다르게 전달해주심\n",
    "## 일단 노션에 나와있는 건 paper_summary, paper_concepts\n",
    "## 우리에게 필요한 건 paper_name, paper_concepts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "3b15104b",
   "metadata": {},
   "outputs": [],
   "source": [
    "BERT = {\n",
    "    \"paper_name\": \"BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding\", \n",
    "    \"paper_summary\": \"BERT(Bidirectional Encoder Representations from Transformers)는 트랜스포머 기반의 심층 양방향 언어 표현 모델로, 양방향 컨텍스트를 동시에 고려하는 사전 학습을 통해 다양한 자연어 이해 작업에서 최첨단 성능을 달성한다. 기존 단방향 언어 모델(예: GPT)과 달리, BERT는 마스크된 언어 모델(MLM)과 다음 문장 예측(NSP) 작업을 통해 사전 학습되며, 미세 조정 시 추가 출력층만 필요로 한다. GLUE, SQuAD, SWAG 등 11개 NLP 작업에서 기존 모델 대비 큰 성능 향상을 보였으며, 모델 크기 증가가 소규모 데이터셋에서도 성능 개선으로 이어짐을 입증했다. 또한, 특징 기반 및 미세 조정 접근법 모두에서 효과적임을 확인했다.\",\n",
    "    \"paper_concepts\": [\n",
    "        \"Bidirectional Language Model\",\n",
    "        \"Masked Language Model (MLM)\",\n",
    "        \"Next Sentence Prediction (NSP)\",\n",
    "        \"Transformer Encoder\",\n",
    "        \"Fine-tuning with Minimal Task-Specific Parameters\"\n",
    "        ]\n",
    "    }\n",
    "\n",
    "\n",
    "GSPO = {\n",
    "    \"paper_name\": \"Group Sequence Policy Optimization\",\n",
    "    \"paper_summary\": \"이 논문은 대규모 언어 모델 훈련을 위한 안정적이고 효율적이며 성능이 우수한 강화 학습 알고리즘인 Group Sequence Policy Optimization(GSPO)을 제안한다. 기존 GRPO 알고리즘의 토큰 수준 중요도 비율 적용 문제를 해결하기 위해 시퀀스 수준 중요도 비율과 클리핑을 도입하여 훈련 안정성과 성능을 개선했다. GSPO는 GRPO 대비 우수한 훈련 효율성과 성능을 보이며, 특히 Mixture-of-Experts(MoE) 모델의 RL 훈련 안정성을 근본적으로 해결하여 복잡한 안정화 전략 없이도 훈련이 가능하다. 또한 RL 인프라 설계 단순화 가능성을 보여주며, 최신 Qwen3 모델의 성능 향상에 기여했다.\",\n",
    "    \"paper_concepts\": [\n",
    "        \"Group Sequence Policy Optimization\",\n",
    "        \"Sequence-level Clipping\",\n",
    "        \"Mixture-of-Experts RL\",\n",
    "        \"Importance Sampling\",\n",
    "        \"Reinforcement Learning Infrastructure\"\n",
    "        ]\n",
    "    }"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ccbc1e4f",
   "metadata": {},
   "source": [
    "### 3. 검색 쿼리\n",
    "- 고려해야 할 것 -> 매칭할 때 syper에서 대소문자 무시하게끔 해줄 수도 있기 때문에 고려해야 함 (현재는 대소문자 처리에 관해서 신경쓰지 않음)\n",
    "- **참고 사이트**\n",
    "    - https://neo4j.com/docs/python-manual/current/query-simple/\n",
    "    - https://neo4j.com/docs/cypher-manual/current/clauses/match/\n",
    "- **GDB 스키마 간단**\n",
    "    - Paper 노드: (:Paper {name, paperId, ...})\n",
    "    - Keyword 노드: (:Keyword {name, alias: [...] ...})\n",
    "\n",
    "    - 엣지\n",
    "        - Paper-[:ABOUT]->Keyword\n",
    "        - Keyword-[:IN]->Paper\n",
    "        - Keyword-[:PREREQ]->Keyword\n",
    "        - Paper-[:REF_BY]->Paper"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "55316127",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'\\n입력: 논문 제목, 키워드 리스트\\n\\n- 논문 제목으로 match 시키고\\n- 키워드 리스트를 받아서 KC와 매치 + alias도 한 번씩 돌고\\n  - 이때 만약 Exact match의 성능이 별로 좋지 않다면 찾고자 하는 키워드의 단어들을 완벽하게 포함하고 있는 노드를 찾기\\n- 해당 논문 노드와 키워드 노드와 연결된 모든 그래프를 가져와야 함\\n  - 이때 너무 많이 가져오면 depth를 제한하거나 하는 방식으로 진행\\n'"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "'''\n",
    "입력: 논문 제목, 키워드 리스트\n",
    "\n",
    "- 논문 제목으로 match 시키고\n",
    "- 키워드 리스트를 받아서 KC와 매치 + alias도 한 번씩 돌고\n",
    "  - 이때 만약 Exact match의 성능이 별로 좋지 않다면 찾고자 하는 키워드의 단어들을 완벽하게 포함하고 있는 노드를 찾기\n",
    "- 해당 논문 노드와 키워드 노드와 연결된 모든 그래프를 가져와야 함\n",
    "  - 이때 너무 많이 가져오면 depth를 제한하거나 하는 방식으로 진행\n",
    "'''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "98e35694",
   "metadata": {},
   "outputs": [],
   "source": [
    "def run_cypher(query: str, params: dict | None = None, limit: int = 10):\n",
    "    params = params or {}\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, params)\n",
    "        rows = [r.data() for r in result]\n",
    "    return rows[:limit]"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c6134da6",
   "metadata": {},
   "source": [
    "#### 3-1. paper 제목 매칭"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a992d900",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': {'citationCount': 108712,\n",
       "   'year': 2019.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 63,\n",
       "   'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "   'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "   'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}}]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 1) Exact match **\n",
    "paper_name = BERT[\"paper_name\"]\n",
    "q = \"\"\"\n",
    "    MATCH (p:Paper {name: $paper_name})\n",
    "    RETURN p\n",
    "    \"\"\"\n",
    "run_cypher(q, {\"paper_name\": paper_name})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "ca83c402",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': {'citationCount': 108712,\n",
       "   'year': 2019.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 63,\n",
       "   'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "   'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "   'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}}]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 2) Exact가 잘 안 잡히면: 대소문자 무시 + contains + 인용 수 내림차순\n",
    "\n",
    "q = \"\"\"\n",
    "MATCH (p:Paper)\n",
    "WHERE toLower(p.name) CONTAINS toLower($paper_name)\n",
    "RETURN p\n",
    "ORDER BY p.citationCount DESC\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "run_cypher(q, {\"paper_name\": paper_name})"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ee10f75e",
   "metadata": {},
   "source": [
    "#### 3-2. 키워드 리스트로 매칭"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "c93e46d8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 1) Exact match\n",
    "\n",
    "concepts = BERT[\"paper_concepts\"]\n",
    "\n",
    "q = \"\"\"\n",
    "MATCH (kc:Keyword)\n",
    "WHERE kc.name IN $concepts\n",
    "RETURN kc\n",
    "\"\"\"\n",
    "run_cypher(q, {\"concepts\": concepts})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5b851645",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'kc': {'name': 'bidirectional language model',\n",
       "   'link': nan,\n",
       "   'alias': ['bidirectional LM',\n",
       "    'bi-directional language model',\n",
       "    'bidirectional language modelling',\n",
       "    'bi-directional LM'],\n",
       "   'categories': []}}]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 2) Exact match + 대소문자 무시\n",
    "\n",
    "concepts = BERT[\"paper_concepts\"]\n",
    "\n",
    "q = \"\"\"\n",
    "MATCH (kc:Keyword)\n",
    "WHERE toLower(kc.name) IN [c IN $concepts | toLower(c)]\n",
    "RETURN kc\n",
    "\"\"\"\n",
    "run_cypher(q, {\"concepts\": concepts})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6eb80e01",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 3) 키워드 name 매칭 + Alias 매칭\n",
    "\n",
    "q = \"\"\"\n",
    "MATCH (kc:Keyword)\n",
    "WHERE kc.name IN $concepts\n",
    "   OR ANY(a IN coalesce(kc.alias, []) WHERE a IN $concepts)\n",
    "RETURN kc\n",
    "\"\"\"\n",
    "# paper에서 뽑힌 키워드 중 Keyword의 name이 하나라도 있는지\n",
    "# Keyword의 alias 속성 내 리스트 안에 어떤 거라도 paper에서 뽑힌 키워드와 매칭되는 게 있는지\n",
    "run_cypher(q, {\"concepts\": concepts})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c51e718e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'kc': {'name': 'Transformer-based encoder',\n",
       "   'link': nan,\n",
       "   'alias': ['transformer-based encoder',\n",
       "    'transformer encoder',\n",
       "    'transformer based encoder'],\n",
       "   'categories': []}},\n",
       " {'kc': {'name': 'bidirectional language model',\n",
       "   'link': nan,\n",
       "   'alias': ['bidirectional LM',\n",
       "    'bi-directional language model',\n",
       "    'bidirectional language modelling',\n",
       "    'bi-directional LM'],\n",
       "   'categories': []}}]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 4) 키워드 name 매칭 + Alias 매칭 + 대소문자 무시 **\n",
    "\n",
    "q = \"\"\"\n",
    "MATCH (kc:Keyword)\n",
    "WHERE toLower(kc.name) IN [c IN $concepts | toLower(c)]\n",
    "   OR ANY(a IN coalesce(kc.alias, [])\n",
    "          WHERE toLower(a) IN [c IN $concepts | toLower(c)])\n",
    "RETURN kc\n",
    "\"\"\"\n",
    "# paper에서 뽑힌 키워드 중 Keyword의 name이 하나라도 있는지\n",
    "# Keyword의 alias 속성 내 리스트 안에 어떤 거라도 paper에서 뽑힌 키워드와 매칭되는 게 있는지\n",
    "run_cypher(q, {\"concepts\": concepts})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "989f29eb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'kc': {'name': 'BERT (language model)',\n",
       "   'link': 'https://en.wikipedia.org/wiki/BERT_%28language_model%29',\n",
       "   'alias': ['bert',\n",
       "    'BERT model',\n",
       "    'bert language model',\n",
       "    'Bidirectional Encoder Representations from Transformers',\n",
       "    'Bidirectional ERT',\n",
       "    'bert transformer'],\n",
       "   'categories': ['2018 in artificial intelligence',\n",
       "    '2018 software',\n",
       "    'Google software',\n",
       "    'Large language models']}},\n",
       " {'kc': {'name': 'BERT',\n",
       "   'link': 'https://en.wikipedia.org/wiki/Bert',\n",
       "   'alias': ['bert',\n",
       "    'Bert',\n",
       "    'Bidirectional Encoder Representations from Transformers',\n",
       "    'bidirectional encoder representations from transformers',\n",
       "    'BERT model',\n",
       "    'bert model'],\n",
       "   'categories': []}},\n",
       " {'kc': {'name': 'BERT model',\n",
       "   'link': nan,\n",
       "   'alias': ['bert',\n",
       "    'bert model',\n",
       "    'Bidirectional Encoder Representations from Transformers',\n",
       "    'Bidirectional ERT',\n",
       "    'BERT'],\n",
       "   'categories': []}},\n",
       " {'kc': {'name': 'Transformer-based encoder',\n",
       "   'link': nan,\n",
       "   'alias': ['transformer-based encoder',\n",
       "    'transformer encoder',\n",
       "    'transformer based encoder'],\n",
       "   'categories': []}},\n",
       " {'kc': {'name': 'Transformer-based encoder-decoder',\n",
       "   'link': nan,\n",
       "   'alias': ['transformer-based encoder decoder',\n",
       "    'transformer based encoder decoder',\n",
       "    'transformer-based encoder/decoder',\n",
       "    'transformer based encoder-decoder',\n",
       "    'transformer encoder decoder',\n",
       "    'transformer encoder-decoder'],\n",
       "   'categories': []}},\n",
       " {'kc': {'name': 'bidirectional encoder representations from transformers',\n",
       "   'link': 'https://en.wikipedia.org/wiki/BERT_%28language_model%29',\n",
       "   'alias': ['BERT',\n",
       "    'bert',\n",
       "    'BidirectionalEncoderRepresentationsFromTransformers',\n",
       "    'bi-encoder representations from transformers',\n",
       "    'BERT model'],\n",
       "   'categories': []}},\n",
       " {'kc': {'name': 'bidirectional language model',\n",
       "   'link': nan,\n",
       "   'alias': ['bidirectional LM',\n",
       "    'bi-directional language model',\n",
       "    'bidirectional language modelling',\n",
       "    'bi-directional LM'],\n",
       "   'categories': []}},\n",
       " {'kc': {'name': 'encoder-decoder transformer architecture',\n",
       "   'link': nan,\n",
       "   'alias': ['encoder decoder transformer architecture',\n",
       "    'encoder-decoder transformer',\n",
       "    'encoder decoder transformer',\n",
       "    'transformer encoder decoder',\n",
       "    'encoder-decoder neural architecture',\n",
       "    'encoder-decoder model'],\n",
       "   'categories': []}},\n",
       " {'kc': {'name': 'hierarchically structured Transformer encoder',\n",
       "   'link': nan,\n",
       "   'alias': ['hierarchical transformer encoder',\n",
       "    'hierarchical structured transformer encoder',\n",
       "    'hierarchical structured transformer',\n",
       "    'hierarchical transformer'],\n",
       "   'categories': []}},\n",
       " {'kc': {'name': 'momentum encoder in ViTs',\n",
       "   'link': nan,\n",
       "   'alias': ['momentum encoder vit',\n",
       "    'momentum encoder in vision transformers',\n",
       "    'momentum encoder vit model',\n",
       "    'momentum encoder for vit',\n",
       "    'momentum encoder vit architecture'],\n",
       "   'categories': []}}]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 5) 논문에서 뽑힌 키워드들을 띄어쓰기 단위로 쪼개서 Keyword나 alias가 이를 모두 포함한다면 매칭\n",
    "# GPT에게 도움을 좀 받은거라 이해하고 원하는 대로 되었는지 확인해야 함\n",
    "\n",
    "q = \"\"\"\n",
    "MATCH (kc:Keyword)\n",
    "WITH kc, $concepts AS concepts\n",
    "WITH kc,\n",
    "     [c IN concepts |\n",
    "        [t IN split(toLower(c), ' ')\n",
    "         WHERE size(t) > 0]\n",
    "     ] AS conceptTokens\n",
    "WITH kc, conceptTokens,\n",
    "     (coalesce(kc.alias, []) + [kc.name]) AS candidates\n",
    "WHERE ANY(tokens IN conceptTokens WHERE\n",
    "          ANY(candidate IN candidates WHERE\n",
    "              ALL(t IN tokens WHERE toLower(candidate) CONTAINS t)\n",
    "          )\n",
    ")\n",
    "RETURN kc\n",
    "\"\"\"\n",
    "\n",
    "run_cypher(q, {\"concepts\": concepts})\n",
    "\n",
    "# 만약 이게 너무 빡세다면 -> 띄어쓰기를 기준으로 나뉘어졌으 ㄹ때 전체 포함 대신 4개 정도 포함으로 가거나..\n",
    "# 만약 짧은 단어는 그럼 매칭되는 경우가 너무 많다는 게 걱정이 된다면 -> 짧은 단어는 일단 Exact match로 진행하거나... (즉, 단어 길이 별로 다르게 진행)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "510c2e44",
   "metadata": {},
   "source": [
    "### 3-3. 해당 paper의 ref paper 가져오기"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "8a24480d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'ref': {'citationCount': 11976,\n",
       "   'year': 2018.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 64,\n",
       "   'name': 'Deep Contextualized Word Representations',\n",
       "   'abstract': 'We introduce a new type of deep contextualized word representation that models both (1) complex characteristics of word use (e.g., syntax and semantics), and (2) how these uses vary across linguistic contexts (i.e., to model polysemy). Our word vectors are learned functions of the internal states of a deep bidirectional language model (biLM), which is pre-trained on a large text corpus. We show that these representations can be easily added to existing models and significantly improve the state of the art across six challenging NLP problems, including question answering, textual entailment and sentiment analysis. We also present an analysis showing that exposing the deep internals of the pre-trained network is crucial, allowing downstream models to mix different types of semi-supervision signals.',\n",
       "   'paperId': '3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "   'url': 'https://www.semanticscholar.org/paper/3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "   'authors': \"[{'authorId': '39139825', 'name': 'Matthew E. Peters'}, {'authorId': '50043859', 'name': 'Mark Neumann'}, {'authorId': '2136562', 'name': 'Mohit Iyyer'}, {'authorId': '40642935', 'name': 'Matt Gardner'}, {'authorId': '143997772', 'name': 'Christopher Clark'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '1982950', 'name': 'Luke Zettlemoyer'}]\"},\n",
       "  'r': ({'citationCount': 11976,\n",
       "    'year': 2018.0,\n",
       "    'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "    'referenceCount': 64,\n",
       "    'name': 'Deep Contextualized Word Representations',\n",
       "    'abstract': 'We introduce a new type of deep contextualized word representation that models both (1) complex characteristics of word use (e.g., syntax and semantics), and (2) how these uses vary across linguistic contexts (i.e., to model polysemy). Our word vectors are learned functions of the internal states of a deep bidirectional language model (biLM), which is pre-trained on a large text corpus. We show that these representations can be easily added to existing models and significantly improve the state of the art across six challenging NLP problems, including question answering, textual entailment and sentiment analysis. We also present an analysis showing that exposing the deep internals of the pre-trained network is crucial, allowing downstream models to mix different types of semi-supervision signals.',\n",
       "    'paperId': '3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "    'url': 'https://www.semanticscholar.org/paper/3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "    'authors': \"[{'authorId': '39139825', 'name': 'Matthew E. Peters'}, {'authorId': '50043859', 'name': 'Mark Neumann'}, {'authorId': '2136562', 'name': 'Mohit Iyyer'}, {'authorId': '40642935', 'name': 'Matt Gardner'}, {'authorId': '143997772', 'name': 'Christopher Clark'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '1982950', 'name': 'Luke Zettlemoyer'}]\"},\n",
       "   'REF_BY',\n",
       "   {})},\n",
       " {'ref': {'citationCount': 4843,\n",
       "   'year': 2017.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 56,\n",
       "   'name': 'A Broad-Coverage Challenge Corpus for Sentence Understanding through Inference',\n",
       "   'abstract': 'This paper introduces the Multi-Genre Natural Language Inference (MultiNLI) corpus, a dataset designed for use in the development and evaluation of machine learning models for sentence understanding. At 433k examples, this resource is one of the largest corpora available for natural language inference (a.k.a. recognizing textual entailment), improving upon available resources in both its coverage and difficulty. MultiNLI accomplishes this by offering data from ten distinct genres of written and spoken English, making it possible to evaluate systems on nearly the full complexity of the language, while supplying an explicit setting for evaluating cross-genre domain adaptation. In addition, an evaluation using existing machine learning models designed for the Stanford NLI corpus shows that it represents a substantially more difficult task than does that corpus, despite the two showing similar levels of inter-annotator agreement.',\n",
       "   'paperId': '5ded2b8c64491b4a67f6d39ce473d4b9347a672e',\n",
       "   'url': 'https://www.semanticscholar.org/paper/5ded2b8c64491b4a67f6d39ce473d4b9347a672e',\n",
       "   'authors': \"[{'authorId': '81840293', 'name': 'Adina Williams'}, {'authorId': '10666396', 'name': 'Nikita Nangia'}, {'authorId': '3644767', 'name': 'Samuel R. Bowman'}]\"},\n",
       "  'r': ({'citationCount': 4843,\n",
       "    'year': 2017.0,\n",
       "    'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "    'referenceCount': 56,\n",
       "    'name': 'A Broad-Coverage Challenge Corpus for Sentence Understanding through Inference',\n",
       "    'abstract': 'This paper introduces the Multi-Genre Natural Language Inference (MultiNLI) corpus, a dataset designed for use in the development and evaluation of machine learning models for sentence understanding. At 433k examples, this resource is one of the largest corpora available for natural language inference (a.k.a. recognizing textual entailment), improving upon available resources in both its coverage and difficulty. MultiNLI accomplishes this by offering data from ten distinct genres of written and spoken English, making it possible to evaluate systems on nearly the full complexity of the language, while supplying an explicit setting for evaluating cross-genre domain adaptation. In addition, an evaluation using existing machine learning models designed for the Stanford NLI corpus shows that it represents a substantially more difficult task than does that corpus, despite the two showing similar levels of inter-annotator agreement.',\n",
       "    'paperId': '5ded2b8c64491b4a67f6d39ce473d4b9347a672e',\n",
       "    'url': 'https://www.semanticscholar.org/paper/5ded2b8c64491b4a67f6d39ce473d4b9347a672e',\n",
       "    'authors': \"[{'authorId': '81840293', 'name': 'Adina Williams'}, {'authorId': '10666396', 'name': 'Nikita Nangia'}, {'authorId': '3644767', 'name': 'Samuel R. Bowman'}]\"},\n",
       "   'REF_BY',\n",
       "   {})},\n",
       " {'ref': {'citationCount': 162388,\n",
       "   'year': 2017.0,\n",
       "   'publication': 'Neural Information Processing Systems',\n",
       "   'referenceCount': 41,\n",
       "   'name': 'Attention is All you Need',\n",
       "   'abstract': 'The dominant sequence transduction models are based on complex recurrent or convolutional neural networks in an encoder-decoder configuration. The best performing models also connect the encoder and decoder through an attention mechanism. We propose a new simple network architecture, the Transformer, based solely on attention mechanisms, dispensing with recurrence and convolutions entirely. Experiments on two machine translation tasks show these models to be superior in quality while being more parallelizable and requiring significantly less time to train. Our model achieves 28.4 BLEU on the WMT 2014 English-to-German translation task, improving over the existing best results, including ensembles by over 2 BLEU. On the WMT 2014 English-to-French translation task, our model establishes a new single-model state-of-the-art BLEU score of 41.8 after training for 3.5 days on eight GPUs, a small fraction of the training costs of the best models from the literature. We show that the Transformer generalizes well to other tasks by applying it successfully to English constituency parsing both with large and limited training data.',\n",
       "   'paperId': '204e3073870fae3d05bcbc2f6a8e263d9b72e776',\n",
       "   'url': 'https://www.semanticscholar.org/paper/204e3073870fae3d05bcbc2f6a8e263d9b72e776',\n",
       "   'authors': nan},\n",
       "  'r': ({'citationCount': 162388,\n",
       "    'year': 2017.0,\n",
       "    'publication': 'Neural Information Processing Systems',\n",
       "    'referenceCount': 41,\n",
       "    'name': 'Attention is All you Need',\n",
       "    'abstract': 'The dominant sequence transduction models are based on complex recurrent or convolutional neural networks in an encoder-decoder configuration. The best performing models also connect the encoder and decoder through an attention mechanism. We propose a new simple network architecture, the Transformer, based solely on attention mechanisms, dispensing with recurrence and convolutions entirely. Experiments on two machine translation tasks show these models to be superior in quality while being more parallelizable and requiring significantly less time to train. Our model achieves 28.4 BLEU on the WMT 2014 English-to-German translation task, improving over the existing best results, including ensembles by over 2 BLEU. On the WMT 2014 English-to-French translation task, our model establishes a new single-model state-of-the-art BLEU score of 41.8 after training for 3.5 days on eight GPUs, a small fraction of the training costs of the best models from the literature. We show that the Transformer generalizes well to other tasks by applying it successfully to English constituency parsing both with large and limited training data.',\n",
       "    'paperId': '204e3073870fae3d05bcbc2f6a8e263d9b72e776',\n",
       "    'url': 'https://www.semanticscholar.org/paper/204e3073870fae3d05bcbc2f6a8e263d9b72e776',\n",
       "    'authors': nan},\n",
       "   'REF_BY',\n",
       "   {})},\n",
       " {'ref': {'citationCount': 8951,\n",
       "   'year': 2016.0,\n",
       "   'publication': 'Conference on Empirical Methods in Natural Language Processing',\n",
       "   'referenceCount': 28,\n",
       "   'name': 'SQuAD: 100,000+ Questions for Machine Comprehension of Text',\n",
       "   'abstract': 'We present the Stanford Question Answering Dataset (SQuAD), a new reading comprehension dataset consisting of 100,000+ questions posed by crowdworkers on a set of Wikipedia articles, where the answer to each question is a segment of text from the corresponding reading passage. We analyze the dataset to understand the types of reasoning required to answer the questions, leaning heavily on dependency and constituency trees. We build a strong logistic regression model, which achieves an F1 score of 51.0%, a significant improvement over a simple baseline (20%). However, human performance (86.8%) is much higher, indicating that the dataset presents a good challenge problem for future research. \\nThe dataset is freely available at this https URL',\n",
       "   'paperId': '05dd7254b632376973f3a1b4d39485da17814df5',\n",
       "   'url': 'https://www.semanticscholar.org/paper/05dd7254b632376973f3a1b4d39485da17814df5',\n",
       "   'authors': nan},\n",
       "  'r': ({'citationCount': 8951,\n",
       "    'year': 2016.0,\n",
       "    'publication': 'Conference on Empirical Methods in Natural Language Processing',\n",
       "    'referenceCount': 28,\n",
       "    'name': 'SQuAD: 100,000+ Questions for Machine Comprehension of Text',\n",
       "    'abstract': 'We present the Stanford Question Answering Dataset (SQuAD), a new reading comprehension dataset consisting of 100,000+ questions posed by crowdworkers on a set of Wikipedia articles, where the answer to each question is a segment of text from the corresponding reading passage. We analyze the dataset to understand the types of reasoning required to answer the questions, leaning heavily on dependency and constituency trees. We build a strong logistic regression model, which achieves an F1 score of 51.0%, a significant improvement over a simple baseline (20%). However, human performance (86.8%) is much higher, indicating that the dataset presents a good challenge problem for future research. \\nThe dataset is freely available at this https URL',\n",
       "    'paperId': '05dd7254b632376973f3a1b4d39485da17814df5',\n",
       "    'url': 'https://www.semanticscholar.org/paper/05dd7254b632376973f3a1b4d39485da17814df5',\n",
       "    'authors': nan},\n",
       "   'REF_BY',\n",
       "   {})},\n",
       " {'ref': {'citationCount': 3348,\n",
       "   'year': 2017.0,\n",
       "   'publication': 'Annual Meeting of the Association for Computational Linguistics',\n",
       "   'referenceCount': 38,\n",
       "   'name': 'TriviaQA: A Large Scale Distantly Supervised Challenge Dataset for Reading Comprehension',\n",
       "   'abstract': 'We present TriviaQA, a challenging reading comprehension dataset containing over 650K question-answer-evidence triples. TriviaQA includes 95K question-answer pairs authored by trivia enthusiasts and independently gathered evidence documents, six per question on average, that provide high quality distant supervision for answering the questions. We show that, in comparison to other recently introduced large-scale datasets, TriviaQA (1) has relatively complex, compositional questions, (2) has considerable syntactic and lexical variability between questions and corresponding answer-evidence sentences, and (3) requires more cross sentence reasoning to find answers. We also present two baseline algorithms: a feature-based classifier and a state-of-the-art neural network, that performs well on SQuAD reading comprehension. Neither approach comes close to human performance (23% and 40% vs. 80%), suggesting that TriviaQA is a challenging testbed that is worth significant future study.',\n",
       "   'paperId': 'f010affab57b5fcf1cd6be23df79d8ec98c7289c',\n",
       "   'url': 'https://www.semanticscholar.org/paper/f010affab57b5fcf1cd6be23df79d8ec98c7289c',\n",
       "   'authors': nan},\n",
       "  'r': ({'citationCount': 3348,\n",
       "    'year': 2017.0,\n",
       "    'publication': 'Annual Meeting of the Association for Computational Linguistics',\n",
       "    'referenceCount': 38,\n",
       "    'name': 'TriviaQA: A Large Scale Distantly Supervised Challenge Dataset for Reading Comprehension',\n",
       "    'abstract': 'We present TriviaQA, a challenging reading comprehension dataset containing over 650K question-answer-evidence triples. TriviaQA includes 95K question-answer pairs authored by trivia enthusiasts and independently gathered evidence documents, six per question on average, that provide high quality distant supervision for answering the questions. We show that, in comparison to other recently introduced large-scale datasets, TriviaQA (1) has relatively complex, compositional questions, (2) has considerable syntactic and lexical variability between questions and corresponding answer-evidence sentences, and (3) requires more cross sentence reasoning to find answers. We also present two baseline algorithms: a feature-based classifier and a state-of-the-art neural network, that performs well on SQuAD reading comprehension. Neither approach comes close to human performance (23% and 40% vs. 80%), suggesting that TriviaQA is a challenging testbed that is worth significant future study.',\n",
       "    'paperId': 'f010affab57b5fcf1cd6be23df79d8ec98c7289c',\n",
       "    'url': 'https://www.semanticscholar.org/paper/f010affab57b5fcf1cd6be23df79d8ec98c7289c',\n",
       "    'authors': nan},\n",
       "   'REF_BY',\n",
       "   {})}]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "q = \"\"\"\n",
    "MATCH (p:Paper {name: $paper_name})\n",
    "MATCH (ref:Paper)-[r:REF_BY]->(p)\n",
    "RETURN ref, r\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "run_cypher(q, {\"paper_name\": paper_name})"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d13ff911",
   "metadata": {},
   "source": [
    "### 3-4. 논문 노드 + 해당 논문의 선행 노드들 + 해당 논문의 fef 논문들 + 매칭된 Keyword 노드 주변 그래프 가져오기"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "e0a12dff",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': {'citationCount': 108712,\n",
       "   'year': 2019.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 63,\n",
       "   'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "   'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "   'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "  'r': ({'citationCount': 108712,\n",
       "    'year': 2019.0,\n",
       "    'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "    'referenceCount': 63,\n",
       "    'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "    'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "    'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "   'ABOUT',\n",
       "   {'name': 'BERT model',\n",
       "    'link': nan,\n",
       "    'alias': ['bert',\n",
       "     'bert model',\n",
       "     'Bidirectional Encoder Representations from Transformers',\n",
       "     'Bidirectional ERT',\n",
       "     'BERT'],\n",
       "    'categories': []}),\n",
       "  'k': {'name': 'BERT model',\n",
       "   'link': nan,\n",
       "   'alias': ['bert',\n",
       "    'bert model',\n",
       "    'Bidirectional Encoder Representations from Transformers',\n",
       "    'Bidirectional ERT',\n",
       "    'BERT'],\n",
       "   'categories': []}},\n",
       " {'p': {'citationCount': 108712,\n",
       "   'year': 2019.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 63,\n",
       "   'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "   'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "   'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "  'r': ({'citationCount': 108712,\n",
       "    'year': 2019.0,\n",
       "    'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "    'referenceCount': 63,\n",
       "    'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "    'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "    'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "   'ABOUT',\n",
       "   {'name': 'Bidirectional Encoder Representations',\n",
       "    'link': nan,\n",
       "    'alias': ['BERT',\n",
       "     'bert',\n",
       "     'BidirectionalEncoderRepresentations',\n",
       "     'bidirectional encoder representations',\n",
       "     'birectional encoder representations'],\n",
       "    'categories': []}),\n",
       "  'k': {'name': 'Bidirectional Encoder Representations',\n",
       "   'link': nan,\n",
       "   'alias': ['BERT',\n",
       "    'bert',\n",
       "    'BidirectionalEncoderRepresentations',\n",
       "    'bidirectional encoder representations',\n",
       "    'birectional encoder representations'],\n",
       "   'categories': []}},\n",
       " {'p': {'citationCount': 108712,\n",
       "   'year': 2019.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 63,\n",
       "   'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "   'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "   'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "  'r': ({'citationCount': 108712,\n",
       "    'year': 2019.0,\n",
       "    'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "    'referenceCount': 63,\n",
       "    'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "    'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "    'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "   'ABOUT',\n",
       "   {'name': 'Deep bidirectional representations',\n",
       "    'link': nan,\n",
       "    'alias': ['deep bidirectional representations',\n",
       "     'deep bidirectional',\n",
       "     'deep bidirec',\n",
       "     'deep bidirectional rep',\n",
       "     'deep bidir',\n",
       "     'deep bidir representations'],\n",
       "    'categories': []}),\n",
       "  'k': {'name': 'Deep bidirectional representations',\n",
       "   'link': nan,\n",
       "   'alias': ['deep bidirectional representations',\n",
       "    'deep bidirectional',\n",
       "    'deep bidirec',\n",
       "    'deep bidirectional rep',\n",
       "    'deep bidir',\n",
       "    'deep bidir representations'],\n",
       "   'categories': []}},\n",
       " {'p': {'citationCount': 108712,\n",
       "   'year': 2019.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 63,\n",
       "   'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "   'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "   'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "  'r': ({'citationCount': 108712,\n",
       "    'year': 2019.0,\n",
       "    'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "    'referenceCount': 63,\n",
       "    'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "    'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "    'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "   'ABOUT',\n",
       "   {'name': 'Fine-tuning with one additional output layer',\n",
       "    'link': nan,\n",
       "    'alias': ['fine tuning with one additional output layer',\n",
       "     'fine-tuning one output layer',\n",
       "     'fine tuning one additional output layer',\n",
       "     'one output layer fine tuning',\n",
       "     'fine tuning with single output layer'],\n",
       "    'categories': []}),\n",
       "  'k': {'name': 'Fine-tuning with one additional output layer',\n",
       "   'link': nan,\n",
       "   'alias': ['fine tuning with one additional output layer',\n",
       "    'fine-tuning one output layer',\n",
       "    'fine tuning one additional output layer',\n",
       "    'one output layer fine tuning',\n",
       "    'fine tuning with single output layer'],\n",
       "   'categories': []}},\n",
       " {'p': {'citationCount': 108712,\n",
       "   'year': 2019.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 63,\n",
       "   'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "   'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "   'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "  'r': ({'citationCount': 108712,\n",
       "    'year': 2019.0,\n",
       "    'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "    'referenceCount': 63,\n",
       "    'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "    'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "    'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "   'ABOUT',\n",
       "   {'name': 'Joint conditioning on left and right context',\n",
       "    'link': nan,\n",
       "    'alias': ['joint conditioning on left and right context',\n",
       "     'joint conditioning left and right context',\n",
       "     'joint conditioning on left and right',\n",
       "     'joint conditioning left and right',\n",
       "     'joint conditioning on l and r context',\n",
       "     'joint conditioning l and r context'],\n",
       "    'categories': []}),\n",
       "  'k': {'name': 'Joint conditioning on left and right context',\n",
       "   'link': nan,\n",
       "   'alias': ['joint conditioning on left and right context',\n",
       "    'joint conditioning left and right context',\n",
       "    'joint conditioning on left and right',\n",
       "    'joint conditioning left and right',\n",
       "    'joint conditioning on l and r context',\n",
       "    'joint conditioning l and r context'],\n",
       "   'categories': []}},\n",
       " {'p': {'citationCount': 108712,\n",
       "   'year': 2019.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 63,\n",
       "   'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "   'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "   'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "  'r': ({'citationCount': 108712,\n",
       "    'year': 2019.0,\n",
       "    'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "    'referenceCount': 63,\n",
       "    'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "    'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "    'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "   'ABOUT',\n",
       "   {'name': 'Pre-training from unlabeled text',\n",
       "    'link': nan,\n",
       "    'alias': ['pre-training from unlabeled text',\n",
       "     'pretraining from unlabeled text',\n",
       "     'pre training from unlabeled text',\n",
       "     'pretraining of models from unlabeled text',\n",
       "     'unsupervised pre-training from text'],\n",
       "    'categories': []}),\n",
       "  'k': {'name': 'Pre-training from unlabeled text',\n",
       "   'link': nan,\n",
       "   'alias': ['pre-training from unlabeled text',\n",
       "    'pretraining from unlabeled text',\n",
       "    'pre training from unlabeled text',\n",
       "    'pretraining of models from unlabeled text',\n",
       "    'unsupervised pre-training from text'],\n",
       "   'categories': []}},\n",
       " {'p': {'citationCount': 108712,\n",
       "   'year': 2019.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 63,\n",
       "   'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "   'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "   'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "  'r': ({'name': 'Question answering',\n",
       "    'link': 'https://en.wikipedia.org/wiki/Question_answering',\n",
       "    'alias': ['question answering',\n",
       "     'question answering system',\n",
       "     'QA',\n",
       "     'qa',\n",
       "     'question-answer',\n",
       "     'question and answer'],\n",
       "    'categories': []},\n",
       "   'IN',\n",
       "   {'citationCount': 108712,\n",
       "    'year': 2019.0,\n",
       "    'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "    'referenceCount': 63,\n",
       "    'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "    'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "    'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}),\n",
       "  'k': {'name': 'Question answering',\n",
       "   'link': 'https://en.wikipedia.org/wiki/Question_answering',\n",
       "   'alias': ['question answering',\n",
       "    'question answering system',\n",
       "    'QA',\n",
       "    'qa',\n",
       "    'question-answer',\n",
       "    'question and answer'],\n",
       "   'categories': []}},\n",
       " {'p': {'citationCount': 108712,\n",
       "   'year': 2019.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 63,\n",
       "   'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "   'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "   'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "  'r': ({'name': 'Fine-tuning',\n",
       "    'link': 'https://en.wikipedia.org/wiki/Fine-tuning',\n",
       "    'alias': ['fine tuning', 'fine-tuning', 'finetuning', 'Fine Tuning'],\n",
       "    'categories': []},\n",
       "   'IN',\n",
       "   {'citationCount': 108712,\n",
       "    'year': 2019.0,\n",
       "    'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "    'referenceCount': 63,\n",
       "    'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "    'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "    'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}),\n",
       "  'k': {'name': 'Fine-tuning',\n",
       "   'link': 'https://en.wikipedia.org/wiki/Fine-tuning',\n",
       "   'alias': ['fine tuning', 'fine-tuning', 'finetuning', 'Fine Tuning'],\n",
       "   'categories': []}},\n",
       " {'p': {'citationCount': 108712,\n",
       "   'year': 2019.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 63,\n",
       "   'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "   'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "   'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "  'r': ({'name': 'Language inference',\n",
       "    'link': nan,\n",
       "    'alias': ['language inference',\n",
       "     'language inference task',\n",
       "     'LI',\n",
       "     'natural language inference',\n",
       "     'NLI',\n",
       "     'text inference'],\n",
       "    'categories': []},\n",
       "   'IN',\n",
       "   {'citationCount': 108712,\n",
       "    'year': 2019.0,\n",
       "    'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "    'referenceCount': 63,\n",
       "    'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "    'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "    'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}),\n",
       "  'k': {'name': 'Language inference',\n",
       "   'link': nan,\n",
       "   'alias': ['language inference',\n",
       "    'language inference task',\n",
       "    'LI',\n",
       "    'natural language inference',\n",
       "    'NLI',\n",
       "    'text inference'],\n",
       "   'categories': []}},\n",
       " {'p': {'citationCount': 108712,\n",
       "   'year': 2019.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 63,\n",
       "   'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "   'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "   'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "  'r': ({'name': 'Language representation model',\n",
       "    'link': nan,\n",
       "    'alias': ['language representation model',\n",
       "     'language representation models',\n",
       "     'LRM',\n",
       "     'language representation',\n",
       "     'representation model',\n",
       "     'language representation modelling'],\n",
       "    'categories': []},\n",
       "   'IN',\n",
       "   {'citationCount': 108712,\n",
       "    'year': 2019.0,\n",
       "    'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "    'referenceCount': 63,\n",
       "    'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "    'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "    'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "    'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}),\n",
       "  'k': {'name': 'Language representation model',\n",
       "   'link': nan,\n",
       "   'alias': ['language representation model',\n",
       "    'language representation models',\n",
       "    'LRM',\n",
       "    'language representation',\n",
       "    'representation model',\n",
       "    'language representation modelling'],\n",
       "   'categories': []}}]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 1) paper와 직접 연결된 Keyword들(ABOUT/IN) 먼저 확인\n",
    "\n",
    "q = \"\"\"\n",
    "MATCH (p:Paper {name:$paper_name})-[r:ABOUT|IN]-(k:Keyword)\n",
    "RETURN p, r, k\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "run_cypher(q, {\"paper_name\": paper_name})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "7a4565a5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'k': {'name': 'Transformer-based encoder',\n",
       "   'link': nan,\n",
       "   'alias': ['transformer-based encoder',\n",
       "    'transformer encoder',\n",
       "    'transformer based encoder'],\n",
       "   'categories': []},\n",
       "  'pre': None,\n",
       "  'pr': None,\n",
       "  'p': {'citationCount': 4880,\n",
       "   'year': 2021.0,\n",
       "   'publication': 'arXiv.org',\n",
       "   'referenceCount': 21,\n",
       "   'name': 'TransUNet: Transformers Make Strong Encoders for Medical Image Segmentation',\n",
       "   'abstract': 'Medical image segmentation is an essential prerequisite for developing healthcare systems, especially for disease diagnosis and treatment planning. On various medical image segmentation tasks, the u-shaped architecture, also known as U-Net, has become the de-facto standard and achieved tremendous success. However, due to the intrinsic locality of convolution operations, U-Net generally demonstrates limitations in explicitly modeling long-range dependency. Transformers, designed for sequence-to-sequence prediction, have emerged as alternative architectures with innate global self-attention mechanisms, but can result in limited localization abilities due to insufficient low-level details. In this paper, we propose TransUNet, which merits both Transformers and U-Net, as a strong alternative for medical image segmentation. On one hand, the Transformer encodes tokenized image patches from a convolution neural network (CNN) feature map as the input sequence for extracting global contexts. On the other hand, the decoder upsamples the encoded features which are then combined with the high-resolution CNN feature maps to enable precise localization. We argue that Transformers can serve as strong encoders for medical image segmentation tasks, with the combination of U-Net to enhance finer details by recovering localized spatial information. TransUNet achieves superior performances to various competing methods on different medical applications including multi-organ segmentation and cardiac segmentation. Code and models are available at https://github.com/Beckschen/TransUNet.',\n",
       "   'paperId': '24b8a0b02bcb7934967757fc59d273a71ba67e30',\n",
       "   'url': 'https://www.semanticscholar.org/paper/24b8a0b02bcb7934967757fc59d273a71ba67e30',\n",
       "   'authors': nan},\n",
       "  'ab': ({'citationCount': 4880,\n",
       "    'year': 2021.0,\n",
       "    'publication': 'arXiv.org',\n",
       "    'referenceCount': 21,\n",
       "    'name': 'TransUNet: Transformers Make Strong Encoders for Medical Image Segmentation',\n",
       "    'abstract': 'Medical image segmentation is an essential prerequisite for developing healthcare systems, especially for disease diagnosis and treatment planning. On various medical image segmentation tasks, the u-shaped architecture, also known as U-Net, has become the de-facto standard and achieved tremendous success. However, due to the intrinsic locality of convolution operations, U-Net generally demonstrates limitations in explicitly modeling long-range dependency. Transformers, designed for sequence-to-sequence prediction, have emerged as alternative architectures with innate global self-attention mechanisms, but can result in limited localization abilities due to insufficient low-level details. In this paper, we propose TransUNet, which merits both Transformers and U-Net, as a strong alternative for medical image segmentation. On one hand, the Transformer encodes tokenized image patches from a convolution neural network (CNN) feature map as the input sequence for extracting global contexts. On the other hand, the decoder upsamples the encoded features which are then combined with the high-resolution CNN feature maps to enable precise localization. We argue that Transformers can serve as strong encoders for medical image segmentation tasks, with the combination of U-Net to enhance finer details by recovering localized spatial information. TransUNet achieves superior performances to various competing methods on different medical applications including multi-organ segmentation and cardiac segmentation. Code and models are available at https://github.com/Beckschen/TransUNet.',\n",
       "    'paperId': '24b8a0b02bcb7934967757fc59d273a71ba67e30',\n",
       "    'url': 'https://www.semanticscholar.org/paper/24b8a0b02bcb7934967757fc59d273a71ba67e30',\n",
       "    'authors': nan},\n",
       "   'ABOUT',\n",
       "   {'name': 'Transformer-based encoder',\n",
       "    'link': nan,\n",
       "    'alias': ['transformer-based encoder',\n",
       "     'transformer encoder',\n",
       "     'transformer based encoder'],\n",
       "    'categories': []})},\n",
       " {'k': {'name': 'bidirectional language model',\n",
       "   'link': nan,\n",
       "   'alias': ['bidirectional LM',\n",
       "    'bi-directional language model',\n",
       "    'bidirectional language modelling',\n",
       "    'bi-directional LM'],\n",
       "   'categories': []},\n",
       "  'pre': None,\n",
       "  'pr': None,\n",
       "  'p': {'citationCount': 11976,\n",
       "   'year': 2018.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 64,\n",
       "   'name': 'Deep Contextualized Word Representations',\n",
       "   'abstract': 'We introduce a new type of deep contextualized word representation that models both (1) complex characteristics of word use (e.g., syntax and semantics), and (2) how these uses vary across linguistic contexts (i.e., to model polysemy). Our word vectors are learned functions of the internal states of a deep bidirectional language model (biLM), which is pre-trained on a large text corpus. We show that these representations can be easily added to existing models and significantly improve the state of the art across six challenging NLP problems, including question answering, textual entailment and sentiment analysis. We also present an analysis showing that exposing the deep internals of the pre-trained network is crucial, allowing downstream models to mix different types of semi-supervision signals.',\n",
       "   'paperId': '3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "   'url': 'https://www.semanticscholar.org/paper/3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "   'authors': \"[{'authorId': '39139825', 'name': 'Matthew E. Peters'}, {'authorId': '50043859', 'name': 'Mark Neumann'}, {'authorId': '2136562', 'name': 'Mohit Iyyer'}, {'authorId': '40642935', 'name': 'Matt Gardner'}, {'authorId': '143997772', 'name': 'Christopher Clark'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '1982950', 'name': 'Luke Zettlemoyer'}]\"},\n",
       "  'ab': ({'citationCount': 11976,\n",
       "    'year': 2018.0,\n",
       "    'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "    'referenceCount': 64,\n",
       "    'name': 'Deep Contextualized Word Representations',\n",
       "    'abstract': 'We introduce a new type of deep contextualized word representation that models both (1) complex characteristics of word use (e.g., syntax and semantics), and (2) how these uses vary across linguistic contexts (i.e., to model polysemy). Our word vectors are learned functions of the internal states of a deep bidirectional language model (biLM), which is pre-trained on a large text corpus. We show that these representations can be easily added to existing models and significantly improve the state of the art across six challenging NLP problems, including question answering, textual entailment and sentiment analysis. We also present an analysis showing that exposing the deep internals of the pre-trained network is crucial, allowing downstream models to mix different types of semi-supervision signals.',\n",
       "    'paperId': '3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "    'url': 'https://www.semanticscholar.org/paper/3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "    'authors': \"[{'authorId': '39139825', 'name': 'Matthew E. Peters'}, {'authorId': '50043859', 'name': 'Mark Neumann'}, {'authorId': '2136562', 'name': 'Mohit Iyyer'}, {'authorId': '40642935', 'name': 'Matt Gardner'}, {'authorId': '143997772', 'name': 'Christopher Clark'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '1982950', 'name': 'Luke Zettlemoyer'}]\"},\n",
       "   'ABOUT',\n",
       "   {'name': 'bidirectional language model',\n",
       "    'link': nan,\n",
       "    'alias': ['bidirectional LM',\n",
       "     'bi-directional language model',\n",
       "     'bidirectional language modelling',\n",
       "     'bi-directional LM'],\n",
       "    'categories': []})}]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 2) 에이전트가 넘겨준 키워드의 선행 개념이 되는 키워드와 그에 관련된 논문 가져오기\n",
    "#    - 선행 개념이 되는 키워드 -[PREREQ]-> 에이전트가 넘겨준 키워드\n",
    "#    - 키워드를 제안한 논문 -[ABOUT]-> 에이전트가 넘겨준 키워드\n",
    "\n",
    "q = \"\"\"\n",
    "WITH [c IN $concepts | toLower(c)] AS cs\n",
    "MATCH (k:Keyword)\n",
    "WHERE toLower(k.name) IN cs\n",
    "   OR ANY(a IN coalesce(k.alias, []) WHERE toLower(a) IN cs)\n",
    "\n",
    "OPTIONAL MATCH (pre:Keyword)-[pr:PREREQ]->(k)\n",
    "OPTIONAL MATCH (p:Paper)-[ab:ABOUT]->(k)\n",
    "\n",
    "RETURN k, pre, pr, p, ab\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "run_cypher(q, {\"concepts\": concepts})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "b8f9a938",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'ref': {'citationCount': 11976,\n",
       "   'year': 2018.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 64,\n",
       "   'name': 'Deep Contextualized Word Representations',\n",
       "   'abstract': 'We introduce a new type of deep contextualized word representation that models both (1) complex characteristics of word use (e.g., syntax and semantics), and (2) how these uses vary across linguistic contexts (i.e., to model polysemy). Our word vectors are learned functions of the internal states of a deep bidirectional language model (biLM), which is pre-trained on a large text corpus. We show that these representations can be easily added to existing models and significantly improve the state of the art across six challenging NLP problems, including question answering, textual entailment and sentiment analysis. We also present an analysis showing that exposing the deep internals of the pre-trained network is crucial, allowing downstream models to mix different types of semi-supervision signals.',\n",
       "   'paperId': '3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "   'url': 'https://www.semanticscholar.org/paper/3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "   'authors': \"[{'authorId': '39139825', 'name': 'Matthew E. Peters'}, {'authorId': '50043859', 'name': 'Mark Neumann'}, {'authorId': '2136562', 'name': 'Mohit Iyyer'}, {'authorId': '40642935', 'name': 'Matt Gardner'}, {'authorId': '143997772', 'name': 'Christopher Clark'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '1982950', 'name': 'Luke Zettlemoyer'}]\"},\n",
       "  'r': ({'citationCount': 11976,\n",
       "    'year': 2018.0,\n",
       "    'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "    'referenceCount': 64,\n",
       "    'name': 'Deep Contextualized Word Representations',\n",
       "    'abstract': 'We introduce a new type of deep contextualized word representation that models both (1) complex characteristics of word use (e.g., syntax and semantics), and (2) how these uses vary across linguistic contexts (i.e., to model polysemy). Our word vectors are learned functions of the internal states of a deep bidirectional language model (biLM), which is pre-trained on a large text corpus. We show that these representations can be easily added to existing models and significantly improve the state of the art across six challenging NLP problems, including question answering, textual entailment and sentiment analysis. We also present an analysis showing that exposing the deep internals of the pre-trained network is crucial, allowing downstream models to mix different types of semi-supervision signals.',\n",
       "    'paperId': '3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "    'url': 'https://www.semanticscholar.org/paper/3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "    'authors': \"[{'authorId': '39139825', 'name': 'Matthew E. Peters'}, {'authorId': '50043859', 'name': 'Mark Neumann'}, {'authorId': '2136562', 'name': 'Mohit Iyyer'}, {'authorId': '40642935', 'name': 'Matt Gardner'}, {'authorId': '143997772', 'name': 'Christopher Clark'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '1982950', 'name': 'Luke Zettlemoyer'}]\"},\n",
       "   'REF_BY',\n",
       "   {})},\n",
       " {'ref': {'citationCount': 4843,\n",
       "   'year': 2017.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 56,\n",
       "   'name': 'A Broad-Coverage Challenge Corpus for Sentence Understanding through Inference',\n",
       "   'abstract': 'This paper introduces the Multi-Genre Natural Language Inference (MultiNLI) corpus, a dataset designed for use in the development and evaluation of machine learning models for sentence understanding. At 433k examples, this resource is one of the largest corpora available for natural language inference (a.k.a. recognizing textual entailment), improving upon available resources in both its coverage and difficulty. MultiNLI accomplishes this by offering data from ten distinct genres of written and spoken English, making it possible to evaluate systems on nearly the full complexity of the language, while supplying an explicit setting for evaluating cross-genre domain adaptation. In addition, an evaluation using existing machine learning models designed for the Stanford NLI corpus shows that it represents a substantially more difficult task than does that corpus, despite the two showing similar levels of inter-annotator agreement.',\n",
       "   'paperId': '5ded2b8c64491b4a67f6d39ce473d4b9347a672e',\n",
       "   'url': 'https://www.semanticscholar.org/paper/5ded2b8c64491b4a67f6d39ce473d4b9347a672e',\n",
       "   'authors': \"[{'authorId': '81840293', 'name': 'Adina Williams'}, {'authorId': '10666396', 'name': 'Nikita Nangia'}, {'authorId': '3644767', 'name': 'Samuel R. Bowman'}]\"},\n",
       "  'r': ({'citationCount': 4843,\n",
       "    'year': 2017.0,\n",
       "    'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "    'referenceCount': 56,\n",
       "    'name': 'A Broad-Coverage Challenge Corpus for Sentence Understanding through Inference',\n",
       "    'abstract': 'This paper introduces the Multi-Genre Natural Language Inference (MultiNLI) corpus, a dataset designed for use in the development and evaluation of machine learning models for sentence understanding. At 433k examples, this resource is one of the largest corpora available for natural language inference (a.k.a. recognizing textual entailment), improving upon available resources in both its coverage and difficulty. MultiNLI accomplishes this by offering data from ten distinct genres of written and spoken English, making it possible to evaluate systems on nearly the full complexity of the language, while supplying an explicit setting for evaluating cross-genre domain adaptation. In addition, an evaluation using existing machine learning models designed for the Stanford NLI corpus shows that it represents a substantially more difficult task than does that corpus, despite the two showing similar levels of inter-annotator agreement.',\n",
       "    'paperId': '5ded2b8c64491b4a67f6d39ce473d4b9347a672e',\n",
       "    'url': 'https://www.semanticscholar.org/paper/5ded2b8c64491b4a67f6d39ce473d4b9347a672e',\n",
       "    'authors': \"[{'authorId': '81840293', 'name': 'Adina Williams'}, {'authorId': '10666396', 'name': 'Nikita Nangia'}, {'authorId': '3644767', 'name': 'Samuel R. Bowman'}]\"},\n",
       "   'REF_BY',\n",
       "   {})},\n",
       " {'ref': {'citationCount': 162388,\n",
       "   'year': 2017.0,\n",
       "   'publication': 'Neural Information Processing Systems',\n",
       "   'referenceCount': 41,\n",
       "   'name': 'Attention is All you Need',\n",
       "   'abstract': 'The dominant sequence transduction models are based on complex recurrent or convolutional neural networks in an encoder-decoder configuration. The best performing models also connect the encoder and decoder through an attention mechanism. We propose a new simple network architecture, the Transformer, based solely on attention mechanisms, dispensing with recurrence and convolutions entirely. Experiments on two machine translation tasks show these models to be superior in quality while being more parallelizable and requiring significantly less time to train. Our model achieves 28.4 BLEU on the WMT 2014 English-to-German translation task, improving over the existing best results, including ensembles by over 2 BLEU. On the WMT 2014 English-to-French translation task, our model establishes a new single-model state-of-the-art BLEU score of 41.8 after training for 3.5 days on eight GPUs, a small fraction of the training costs of the best models from the literature. We show that the Transformer generalizes well to other tasks by applying it successfully to English constituency parsing both with large and limited training data.',\n",
       "   'paperId': '204e3073870fae3d05bcbc2f6a8e263d9b72e776',\n",
       "   'url': 'https://www.semanticscholar.org/paper/204e3073870fae3d05bcbc2f6a8e263d9b72e776',\n",
       "   'authors': nan},\n",
       "  'r': ({'citationCount': 162388,\n",
       "    'year': 2017.0,\n",
       "    'publication': 'Neural Information Processing Systems',\n",
       "    'referenceCount': 41,\n",
       "    'name': 'Attention is All you Need',\n",
       "    'abstract': 'The dominant sequence transduction models are based on complex recurrent or convolutional neural networks in an encoder-decoder configuration. The best performing models also connect the encoder and decoder through an attention mechanism. We propose a new simple network architecture, the Transformer, based solely on attention mechanisms, dispensing with recurrence and convolutions entirely. Experiments on two machine translation tasks show these models to be superior in quality while being more parallelizable and requiring significantly less time to train. Our model achieves 28.4 BLEU on the WMT 2014 English-to-German translation task, improving over the existing best results, including ensembles by over 2 BLEU. On the WMT 2014 English-to-French translation task, our model establishes a new single-model state-of-the-art BLEU score of 41.8 after training for 3.5 days on eight GPUs, a small fraction of the training costs of the best models from the literature. We show that the Transformer generalizes well to other tasks by applying it successfully to English constituency parsing both with large and limited training data.',\n",
       "    'paperId': '204e3073870fae3d05bcbc2f6a8e263d9b72e776',\n",
       "    'url': 'https://www.semanticscholar.org/paper/204e3073870fae3d05bcbc2f6a8e263d9b72e776',\n",
       "    'authors': nan},\n",
       "   'REF_BY',\n",
       "   {})},\n",
       " {'ref': {'citationCount': 8951,\n",
       "   'year': 2016.0,\n",
       "   'publication': 'Conference on Empirical Methods in Natural Language Processing',\n",
       "   'referenceCount': 28,\n",
       "   'name': 'SQuAD: 100,000+ Questions for Machine Comprehension of Text',\n",
       "   'abstract': 'We present the Stanford Question Answering Dataset (SQuAD), a new reading comprehension dataset consisting of 100,000+ questions posed by crowdworkers on a set of Wikipedia articles, where the answer to each question is a segment of text from the corresponding reading passage. We analyze the dataset to understand the types of reasoning required to answer the questions, leaning heavily on dependency and constituency trees. We build a strong logistic regression model, which achieves an F1 score of 51.0%, a significant improvement over a simple baseline (20%). However, human performance (86.8%) is much higher, indicating that the dataset presents a good challenge problem for future research. \\nThe dataset is freely available at this https URL',\n",
       "   'paperId': '05dd7254b632376973f3a1b4d39485da17814df5',\n",
       "   'url': 'https://www.semanticscholar.org/paper/05dd7254b632376973f3a1b4d39485da17814df5',\n",
       "   'authors': nan},\n",
       "  'r': ({'citationCount': 8951,\n",
       "    'year': 2016.0,\n",
       "    'publication': 'Conference on Empirical Methods in Natural Language Processing',\n",
       "    'referenceCount': 28,\n",
       "    'name': 'SQuAD: 100,000+ Questions for Machine Comprehension of Text',\n",
       "    'abstract': 'We present the Stanford Question Answering Dataset (SQuAD), a new reading comprehension dataset consisting of 100,000+ questions posed by crowdworkers on a set of Wikipedia articles, where the answer to each question is a segment of text from the corresponding reading passage. We analyze the dataset to understand the types of reasoning required to answer the questions, leaning heavily on dependency and constituency trees. We build a strong logistic regression model, which achieves an F1 score of 51.0%, a significant improvement over a simple baseline (20%). However, human performance (86.8%) is much higher, indicating that the dataset presents a good challenge problem for future research. \\nThe dataset is freely available at this https URL',\n",
       "    'paperId': '05dd7254b632376973f3a1b4d39485da17814df5',\n",
       "    'url': 'https://www.semanticscholar.org/paper/05dd7254b632376973f3a1b4d39485da17814df5',\n",
       "    'authors': nan},\n",
       "   'REF_BY',\n",
       "   {})},\n",
       " {'ref': {'citationCount': 3348,\n",
       "   'year': 2017.0,\n",
       "   'publication': 'Annual Meeting of the Association for Computational Linguistics',\n",
       "   'referenceCount': 38,\n",
       "   'name': 'TriviaQA: A Large Scale Distantly Supervised Challenge Dataset for Reading Comprehension',\n",
       "   'abstract': 'We present TriviaQA, a challenging reading comprehension dataset containing over 650K question-answer-evidence triples. TriviaQA includes 95K question-answer pairs authored by trivia enthusiasts and independently gathered evidence documents, six per question on average, that provide high quality distant supervision for answering the questions. We show that, in comparison to other recently introduced large-scale datasets, TriviaQA (1) has relatively complex, compositional questions, (2) has considerable syntactic and lexical variability between questions and corresponding answer-evidence sentences, and (3) requires more cross sentence reasoning to find answers. We also present two baseline algorithms: a feature-based classifier and a state-of-the-art neural network, that performs well on SQuAD reading comprehension. Neither approach comes close to human performance (23% and 40% vs. 80%), suggesting that TriviaQA is a challenging testbed that is worth significant future study.',\n",
       "   'paperId': 'f010affab57b5fcf1cd6be23df79d8ec98c7289c',\n",
       "   'url': 'https://www.semanticscholar.org/paper/f010affab57b5fcf1cd6be23df79d8ec98c7289c',\n",
       "   'authors': nan},\n",
       "  'r': ({'citationCount': 3348,\n",
       "    'year': 2017.0,\n",
       "    'publication': 'Annual Meeting of the Association for Computational Linguistics',\n",
       "    'referenceCount': 38,\n",
       "    'name': 'TriviaQA: A Large Scale Distantly Supervised Challenge Dataset for Reading Comprehension',\n",
       "    'abstract': 'We present TriviaQA, a challenging reading comprehension dataset containing over 650K question-answer-evidence triples. TriviaQA includes 95K question-answer pairs authored by trivia enthusiasts and independently gathered evidence documents, six per question on average, that provide high quality distant supervision for answering the questions. We show that, in comparison to other recently introduced large-scale datasets, TriviaQA (1) has relatively complex, compositional questions, (2) has considerable syntactic and lexical variability between questions and corresponding answer-evidence sentences, and (3) requires more cross sentence reasoning to find answers. We also present two baseline algorithms: a feature-based classifier and a state-of-the-art neural network, that performs well on SQuAD reading comprehension. Neither approach comes close to human performance (23% and 40% vs. 80%), suggesting that TriviaQA is a challenging testbed that is worth significant future study.',\n",
       "    'paperId': 'f010affab57b5fcf1cd6be23df79d8ec98c7289c',\n",
       "    'url': 'https://www.semanticscholar.org/paper/f010affab57b5fcf1cd6be23df79d8ec98c7289c',\n",
       "    'authors': nan},\n",
       "   'REF_BY',\n",
       "   {})}]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 3) 타겟 논문이 참고한 ref 논문\n",
    "\n",
    "q = \"\"\"\n",
    "MATCH (p:Paper {name: $paper_name})\n",
    "MATCH (ref:Paper)-[r:REF_BY]->(p)\n",
    "RETURN ref, r\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "run_cypher(q, {\"paper_name\": paper_name})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "c107f586",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'target_paper': {'citationCount': 108712,\n",
       "   'year': 2019.0,\n",
       "   'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "   'referenceCount': 63,\n",
       "   'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "   'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "   'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "   'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "  'paper_kw_links': [{'r': ({'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "     'ABOUT',\n",
       "     {'name': 'BERT model',\n",
       "      'link': nan,\n",
       "      'alias': ['bert',\n",
       "       'bert model',\n",
       "       'Bidirectional Encoder Representations from Transformers',\n",
       "       'Bidirectional ERT',\n",
       "       'BERT'],\n",
       "      'categories': []}),\n",
       "    'k': {'name': 'BERT model',\n",
       "     'link': nan,\n",
       "     'alias': ['bert',\n",
       "      'bert model',\n",
       "      'Bidirectional Encoder Representations from Transformers',\n",
       "      'Bidirectional ERT',\n",
       "      'BERT'],\n",
       "     'categories': []}},\n",
       "   {'r': ({'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "     'ABOUT',\n",
       "     {'name': 'Bidirectional Encoder Representations',\n",
       "      'link': nan,\n",
       "      'alias': ['BERT',\n",
       "       'bert',\n",
       "       'BidirectionalEncoderRepresentations',\n",
       "       'bidirectional encoder representations',\n",
       "       'birectional encoder representations'],\n",
       "      'categories': []}),\n",
       "    'k': {'name': 'Bidirectional Encoder Representations',\n",
       "     'link': nan,\n",
       "     'alias': ['BERT',\n",
       "      'bert',\n",
       "      'BidirectionalEncoderRepresentations',\n",
       "      'bidirectional encoder representations',\n",
       "      'birectional encoder representations'],\n",
       "     'categories': []}},\n",
       "   {'r': ({'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "     'ABOUT',\n",
       "     {'name': 'Deep bidirectional representations',\n",
       "      'link': nan,\n",
       "      'alias': ['deep bidirectional representations',\n",
       "       'deep bidirectional',\n",
       "       'deep bidirec',\n",
       "       'deep bidirectional rep',\n",
       "       'deep bidir',\n",
       "       'deep bidir representations'],\n",
       "      'categories': []}),\n",
       "    'k': {'name': 'Deep bidirectional representations',\n",
       "     'link': nan,\n",
       "     'alias': ['deep bidirectional representations',\n",
       "      'deep bidirectional',\n",
       "      'deep bidirec',\n",
       "      'deep bidirectional rep',\n",
       "      'deep bidir',\n",
       "      'deep bidir representations'],\n",
       "     'categories': []}},\n",
       "   {'r': ({'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "     'ABOUT',\n",
       "     {'name': 'Fine-tuning with one additional output layer',\n",
       "      'link': nan,\n",
       "      'alias': ['fine tuning with one additional output layer',\n",
       "       'fine-tuning one output layer',\n",
       "       'fine tuning one additional output layer',\n",
       "       'one output layer fine tuning',\n",
       "       'fine tuning with single output layer'],\n",
       "      'categories': []}),\n",
       "    'k': {'name': 'Fine-tuning with one additional output layer',\n",
       "     'link': nan,\n",
       "     'alias': ['fine tuning with one additional output layer',\n",
       "      'fine-tuning one output layer',\n",
       "      'fine tuning one additional output layer',\n",
       "      'one output layer fine tuning',\n",
       "      'fine tuning with single output layer'],\n",
       "     'categories': []}},\n",
       "   {'r': ({'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "     'ABOUT',\n",
       "     {'name': 'Joint conditioning on left and right context',\n",
       "      'link': nan,\n",
       "      'alias': ['joint conditioning on left and right context',\n",
       "       'joint conditioning left and right context',\n",
       "       'joint conditioning on left and right',\n",
       "       'joint conditioning left and right',\n",
       "       'joint conditioning on l and r context',\n",
       "       'joint conditioning l and r context'],\n",
       "      'categories': []}),\n",
       "    'k': {'name': 'Joint conditioning on left and right context',\n",
       "     'link': nan,\n",
       "     'alias': ['joint conditioning on left and right context',\n",
       "      'joint conditioning left and right context',\n",
       "      'joint conditioning on left and right',\n",
       "      'joint conditioning left and right',\n",
       "      'joint conditioning on l and r context',\n",
       "      'joint conditioning l and r context'],\n",
       "     'categories': []}},\n",
       "   {'r': ({'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"},\n",
       "     'ABOUT',\n",
       "     {'name': 'Pre-training from unlabeled text',\n",
       "      'link': nan,\n",
       "      'alias': ['pre-training from unlabeled text',\n",
       "       'pretraining from unlabeled text',\n",
       "       'pre training from unlabeled text',\n",
       "       'pretraining of models from unlabeled text',\n",
       "       'unsupervised pre-training from text'],\n",
       "      'categories': []}),\n",
       "    'k': {'name': 'Pre-training from unlabeled text',\n",
       "     'link': nan,\n",
       "     'alias': ['pre-training from unlabeled text',\n",
       "      'pretraining from unlabeled text',\n",
       "      'pre training from unlabeled text',\n",
       "      'pretraining of models from unlabeled text',\n",
       "      'unsupervised pre-training from text'],\n",
       "     'categories': []}},\n",
       "   {'r': ({'name': 'Question answering',\n",
       "      'link': 'https://en.wikipedia.org/wiki/Question_answering',\n",
       "      'alias': ['question answering',\n",
       "       'question answering system',\n",
       "       'QA',\n",
       "       'qa',\n",
       "       'question-answer',\n",
       "       'question and answer'],\n",
       "      'categories': []},\n",
       "     'IN',\n",
       "     {'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}),\n",
       "    'k': {'name': 'Question answering',\n",
       "     'link': 'https://en.wikipedia.org/wiki/Question_answering',\n",
       "     'alias': ['question answering',\n",
       "      'question answering system',\n",
       "      'QA',\n",
       "      'qa',\n",
       "      'question-answer',\n",
       "      'question and answer'],\n",
       "     'categories': []}},\n",
       "   {'r': ({'name': 'Fine-tuning',\n",
       "      'link': 'https://en.wikipedia.org/wiki/Fine-tuning',\n",
       "      'alias': ['fine tuning', 'fine-tuning', 'finetuning', 'Fine Tuning'],\n",
       "      'categories': []},\n",
       "     'IN',\n",
       "     {'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}),\n",
       "    'k': {'name': 'Fine-tuning',\n",
       "     'link': 'https://en.wikipedia.org/wiki/Fine-tuning',\n",
       "     'alias': ['fine tuning', 'fine-tuning', 'finetuning', 'Fine Tuning'],\n",
       "     'categories': []}},\n",
       "   {'r': ({'name': 'Language inference',\n",
       "      'link': nan,\n",
       "      'alias': ['language inference',\n",
       "       'language inference task',\n",
       "       'LI',\n",
       "       'natural language inference',\n",
       "       'NLI',\n",
       "       'text inference'],\n",
       "      'categories': []},\n",
       "     'IN',\n",
       "     {'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}),\n",
       "    'k': {'name': 'Language inference',\n",
       "     'link': nan,\n",
       "     'alias': ['language inference',\n",
       "      'language inference task',\n",
       "      'LI',\n",
       "      'natural language inference',\n",
       "      'NLI',\n",
       "      'text inference'],\n",
       "     'categories': []}},\n",
       "   {'r': ({'name': 'Language representation model',\n",
       "      'link': nan,\n",
       "      'alias': ['language representation model',\n",
       "       'language representation models',\n",
       "       'LRM',\n",
       "       'language representation',\n",
       "       'representation model',\n",
       "       'language representation modelling'],\n",
       "      'categories': []},\n",
       "     'IN',\n",
       "     {'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}),\n",
       "    'k': {'name': 'Language representation model',\n",
       "     'link': nan,\n",
       "     'alias': ['language representation model',\n",
       "      'language representation models',\n",
       "      'LRM',\n",
       "      'language representation',\n",
       "      'representation model',\n",
       "      'language representation modelling'],\n",
       "     'categories': []}},\n",
       "   {'r': ({'name': 'Natural language processing tasks',\n",
       "      'link': nan,\n",
       "      'alias': ['NLP tasks',\n",
       "       'natural language processing tasks',\n",
       "       'nlp tasks',\n",
       "       'natural language tasks',\n",
       "       'NLP task',\n",
       "       'natural language processing task'],\n",
       "      'categories': []},\n",
       "     'IN',\n",
       "     {'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}),\n",
       "    'k': {'name': 'Natural language processing tasks',\n",
       "     'link': nan,\n",
       "     'alias': ['NLP tasks',\n",
       "      'natural language processing tasks',\n",
       "      'nlp tasks',\n",
       "      'natural language tasks',\n",
       "      'NLP task',\n",
       "      'natural language processing task'],\n",
       "     'categories': []}},\n",
       "   {'r': ({'name': 'Transformer architecture',\n",
       "      'link': 'https://en.wikipedia.org/wiki/Transformer_%28deep_learning%29',\n",
       "      'alias': ['transformer architecture',\n",
       "       'Transformer Architecture',\n",
       "       'transformer_architecture',\n",
       "       'transformer',\n",
       "       'transformer model',\n",
       "       'transformer architecture model'],\n",
       "      'categories': []},\n",
       "     'IN',\n",
       "     {'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}),\n",
       "    'k': {'name': 'Transformer architecture',\n",
       "     'link': 'https://en.wikipedia.org/wiki/Transformer_%28deep_learning%29',\n",
       "     'alias': ['transformer architecture',\n",
       "      'Transformer Architecture',\n",
       "      'transformer_architecture',\n",
       "      'transformer',\n",
       "      'transformer model',\n",
       "      'transformer architecture model'],\n",
       "     'categories': []}}],\n",
       "  'matched_keywords': [{'name': 'Transformer-based encoder',\n",
       "    'link': nan,\n",
       "    'alias': ['transformer-based encoder',\n",
       "     'transformer encoder',\n",
       "     'transformer based encoder'],\n",
       "    'categories': []},\n",
       "   {'name': 'bidirectional language model',\n",
       "    'link': nan,\n",
       "    'alias': ['bidirectional LM',\n",
       "     'bi-directional language model',\n",
       "     'bidirectional language modelling',\n",
       "     'bi-directional LM'],\n",
       "    'categories': []}],\n",
       "  'prereq_paths': [],\n",
       "  'seed_about_links': [{'r': ({'citationCount': 4880,\n",
       "      'year': 2021.0,\n",
       "      'publication': 'arXiv.org',\n",
       "      'referenceCount': 21,\n",
       "      'name': 'TransUNet: Transformers Make Strong Encoders for Medical Image Segmentation',\n",
       "      'abstract': 'Medical image segmentation is an essential prerequisite for developing healthcare systems, especially for disease diagnosis and treatment planning. On various medical image segmentation tasks, the u-shaped architecture, also known as U-Net, has become the de-facto standard and achieved tremendous success. However, due to the intrinsic locality of convolution operations, U-Net generally demonstrates limitations in explicitly modeling long-range dependency. Transformers, designed for sequence-to-sequence prediction, have emerged as alternative architectures with innate global self-attention mechanisms, but can result in limited localization abilities due to insufficient low-level details. In this paper, we propose TransUNet, which merits both Transformers and U-Net, as a strong alternative for medical image segmentation. On one hand, the Transformer encodes tokenized image patches from a convolution neural network (CNN) feature map as the input sequence for extracting global contexts. On the other hand, the decoder upsamples the encoded features which are then combined with the high-resolution CNN feature maps to enable precise localization. We argue that Transformers can serve as strong encoders for medical image segmentation tasks, with the combination of U-Net to enhance finer details by recovering localized spatial information. TransUNet achieves superior performances to various competing methods on different medical applications including multi-organ segmentation and cardiac segmentation. Code and models are available at https://github.com/Beckschen/TransUNet.',\n",
       "      'paperId': '24b8a0b02bcb7934967757fc59d273a71ba67e30',\n",
       "      'url': 'https://www.semanticscholar.org/paper/24b8a0b02bcb7934967757fc59d273a71ba67e30',\n",
       "      'authors': nan},\n",
       "     'ABOUT',\n",
       "     {'name': 'Transformer-based encoder',\n",
       "      'link': nan,\n",
       "      'alias': ['transformer-based encoder',\n",
       "       'transformer encoder',\n",
       "       'transformer based encoder'],\n",
       "      'categories': []}),\n",
       "    'p': {'citationCount': 4880,\n",
       "     'year': 2021.0,\n",
       "     'publication': 'arXiv.org',\n",
       "     'referenceCount': 21,\n",
       "     'name': 'TransUNet: Transformers Make Strong Encoders for Medical Image Segmentation',\n",
       "     'abstract': 'Medical image segmentation is an essential prerequisite for developing healthcare systems, especially for disease diagnosis and treatment planning. On various medical image segmentation tasks, the u-shaped architecture, also known as U-Net, has become the de-facto standard and achieved tremendous success. However, due to the intrinsic locality of convolution operations, U-Net generally demonstrates limitations in explicitly modeling long-range dependency. Transformers, designed for sequence-to-sequence prediction, have emerged as alternative architectures with innate global self-attention mechanisms, but can result in limited localization abilities due to insufficient low-level details. In this paper, we propose TransUNet, which merits both Transformers and U-Net, as a strong alternative for medical image segmentation. On one hand, the Transformer encodes tokenized image patches from a convolution neural network (CNN) feature map as the input sequence for extracting global contexts. On the other hand, the decoder upsamples the encoded features which are then combined with the high-resolution CNN feature maps to enable precise localization. We argue that Transformers can serve as strong encoders for medical image segmentation tasks, with the combination of U-Net to enhance finer details by recovering localized spatial information. TransUNet achieves superior performances to various competing methods on different medical applications including multi-organ segmentation and cardiac segmentation. Code and models are available at https://github.com/Beckschen/TransUNet.',\n",
       "     'paperId': '24b8a0b02bcb7934967757fc59d273a71ba67e30',\n",
       "     'url': 'https://www.semanticscholar.org/paper/24b8a0b02bcb7934967757fc59d273a71ba67e30',\n",
       "     'authors': nan},\n",
       "    'k': {'name': 'Transformer-based encoder',\n",
       "     'link': nan,\n",
       "     'alias': ['transformer-based encoder',\n",
       "      'transformer encoder',\n",
       "      'transformer based encoder'],\n",
       "     'categories': []}},\n",
       "   {'r': ({'citationCount': 11976,\n",
       "      'year': 2018.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 64,\n",
       "      'name': 'Deep Contextualized Word Representations',\n",
       "      'abstract': 'We introduce a new type of deep contextualized word representation that models both (1) complex characteristics of word use (e.g., syntax and semantics), and (2) how these uses vary across linguistic contexts (i.e., to model polysemy). Our word vectors are learned functions of the internal states of a deep bidirectional language model (biLM), which is pre-trained on a large text corpus. We show that these representations can be easily added to existing models and significantly improve the state of the art across six challenging NLP problems, including question answering, textual entailment and sentiment analysis. We also present an analysis showing that exposing the deep internals of the pre-trained network is crucial, allowing downstream models to mix different types of semi-supervision signals.',\n",
       "      'paperId': '3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "      'url': 'https://www.semanticscholar.org/paper/3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "      'authors': \"[{'authorId': '39139825', 'name': 'Matthew E. Peters'}, {'authorId': '50043859', 'name': 'Mark Neumann'}, {'authorId': '2136562', 'name': 'Mohit Iyyer'}, {'authorId': '40642935', 'name': 'Matt Gardner'}, {'authorId': '143997772', 'name': 'Christopher Clark'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '1982950', 'name': 'Luke Zettlemoyer'}]\"},\n",
       "     'ABOUT',\n",
       "     {'name': 'bidirectional language model',\n",
       "      'link': nan,\n",
       "      'alias': ['bidirectional LM',\n",
       "       'bi-directional language model',\n",
       "       'bidirectional language modelling',\n",
       "       'bi-directional LM'],\n",
       "      'categories': []}),\n",
       "    'p': {'citationCount': 11976,\n",
       "     'year': 2018.0,\n",
       "     'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "     'referenceCount': 64,\n",
       "     'name': 'Deep Contextualized Word Representations',\n",
       "     'abstract': 'We introduce a new type of deep contextualized word representation that models both (1) complex characteristics of word use (e.g., syntax and semantics), and (2) how these uses vary across linguistic contexts (i.e., to model polysemy). Our word vectors are learned functions of the internal states of a deep bidirectional language model (biLM), which is pre-trained on a large text corpus. We show that these representations can be easily added to existing models and significantly improve the state of the art across six challenging NLP problems, including question answering, textual entailment and sentiment analysis. We also present an analysis showing that exposing the deep internals of the pre-trained network is crucial, allowing downstream models to mix different types of semi-supervision signals.',\n",
       "     'paperId': '3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "     'url': 'https://www.semanticscholar.org/paper/3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "     'authors': \"[{'authorId': '39139825', 'name': 'Matthew E. Peters'}, {'authorId': '50043859', 'name': 'Mark Neumann'}, {'authorId': '2136562', 'name': 'Mohit Iyyer'}, {'authorId': '40642935', 'name': 'Matt Gardner'}, {'authorId': '143997772', 'name': 'Christopher Clark'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '1982950', 'name': 'Luke Zettlemoyer'}]\"},\n",
       "    'k': {'name': 'bidirectional language model',\n",
       "     'link': nan,\n",
       "     'alias': ['bidirectional LM',\n",
       "      'bi-directional language model',\n",
       "      'bidirectional language modelling',\n",
       "      'bi-directional LM'],\n",
       "     'categories': []}}],\n",
       "  'ref_links': [{'r': ({'citationCount': 11976,\n",
       "      'year': 2018.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 64,\n",
       "      'name': 'Deep Contextualized Word Representations',\n",
       "      'abstract': 'We introduce a new type of deep contextualized word representation that models both (1) complex characteristics of word use (e.g., syntax and semantics), and (2) how these uses vary across linguistic contexts (i.e., to model polysemy). Our word vectors are learned functions of the internal states of a deep bidirectional language model (biLM), which is pre-trained on a large text corpus. We show that these representations can be easily added to existing models and significantly improve the state of the art across six challenging NLP problems, including question answering, textual entailment and sentiment analysis. We also present an analysis showing that exposing the deep internals of the pre-trained network is crucial, allowing downstream models to mix different types of semi-supervision signals.',\n",
       "      'paperId': '3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "      'url': 'https://www.semanticscholar.org/paper/3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "      'authors': \"[{'authorId': '39139825', 'name': 'Matthew E. Peters'}, {'authorId': '50043859', 'name': 'Mark Neumann'}, {'authorId': '2136562', 'name': 'Mohit Iyyer'}, {'authorId': '40642935', 'name': 'Matt Gardner'}, {'authorId': '143997772', 'name': 'Christopher Clark'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '1982950', 'name': 'Luke Zettlemoyer'}]\"},\n",
       "     'REF_BY',\n",
       "     {'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}),\n",
       "    'p': {'citationCount': 11976,\n",
       "     'year': 2018.0,\n",
       "     'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "     'referenceCount': 64,\n",
       "     'name': 'Deep Contextualized Word Representations',\n",
       "     'abstract': 'We introduce a new type of deep contextualized word representation that models both (1) complex characteristics of word use (e.g., syntax and semantics), and (2) how these uses vary across linguistic contexts (i.e., to model polysemy). Our word vectors are learned functions of the internal states of a deep bidirectional language model (biLM), which is pre-trained on a large text corpus. We show that these representations can be easily added to existing models and significantly improve the state of the art across six challenging NLP problems, including question answering, textual entailment and sentiment analysis. We also present an analysis showing that exposing the deep internals of the pre-trained network is crucial, allowing downstream models to mix different types of semi-supervision signals.',\n",
       "     'paperId': '3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "     'url': 'https://www.semanticscholar.org/paper/3febb2bed8865945e7fddc99efd791887bb7e14f',\n",
       "     'authors': \"[{'authorId': '39139825', 'name': 'Matthew E. Peters'}, {'authorId': '50043859', 'name': 'Mark Neumann'}, {'authorId': '2136562', 'name': 'Mohit Iyyer'}, {'authorId': '40642935', 'name': 'Matt Gardner'}, {'authorId': '143997772', 'name': 'Christopher Clark'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '1982950', 'name': 'Luke Zettlemoyer'}]\"}},\n",
       "   {'r': ({'citationCount': 4843,\n",
       "      'year': 2017.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 56,\n",
       "      'name': 'A Broad-Coverage Challenge Corpus for Sentence Understanding through Inference',\n",
       "      'abstract': 'This paper introduces the Multi-Genre Natural Language Inference (MultiNLI) corpus, a dataset designed for use in the development and evaluation of machine learning models for sentence understanding. At 433k examples, this resource is one of the largest corpora available for natural language inference (a.k.a. recognizing textual entailment), improving upon available resources in both its coverage and difficulty. MultiNLI accomplishes this by offering data from ten distinct genres of written and spoken English, making it possible to evaluate systems on nearly the full complexity of the language, while supplying an explicit setting for evaluating cross-genre domain adaptation. In addition, an evaluation using existing machine learning models designed for the Stanford NLI corpus shows that it represents a substantially more difficult task than does that corpus, despite the two showing similar levels of inter-annotator agreement.',\n",
       "      'paperId': '5ded2b8c64491b4a67f6d39ce473d4b9347a672e',\n",
       "      'url': 'https://www.semanticscholar.org/paper/5ded2b8c64491b4a67f6d39ce473d4b9347a672e',\n",
       "      'authors': \"[{'authorId': '81840293', 'name': 'Adina Williams'}, {'authorId': '10666396', 'name': 'Nikita Nangia'}, {'authorId': '3644767', 'name': 'Samuel R. Bowman'}]\"},\n",
       "     'REF_BY',\n",
       "     {'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}),\n",
       "    'p': {'citationCount': 4843,\n",
       "     'year': 2017.0,\n",
       "     'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "     'referenceCount': 56,\n",
       "     'name': 'A Broad-Coverage Challenge Corpus for Sentence Understanding through Inference',\n",
       "     'abstract': 'This paper introduces the Multi-Genre Natural Language Inference (MultiNLI) corpus, a dataset designed for use in the development and evaluation of machine learning models for sentence understanding. At 433k examples, this resource is one of the largest corpora available for natural language inference (a.k.a. recognizing textual entailment), improving upon available resources in both its coverage and difficulty. MultiNLI accomplishes this by offering data from ten distinct genres of written and spoken English, making it possible to evaluate systems on nearly the full complexity of the language, while supplying an explicit setting for evaluating cross-genre domain adaptation. In addition, an evaluation using existing machine learning models designed for the Stanford NLI corpus shows that it represents a substantially more difficult task than does that corpus, despite the two showing similar levels of inter-annotator agreement.',\n",
       "     'paperId': '5ded2b8c64491b4a67f6d39ce473d4b9347a672e',\n",
       "     'url': 'https://www.semanticscholar.org/paper/5ded2b8c64491b4a67f6d39ce473d4b9347a672e',\n",
       "     'authors': \"[{'authorId': '81840293', 'name': 'Adina Williams'}, {'authorId': '10666396', 'name': 'Nikita Nangia'}, {'authorId': '3644767', 'name': 'Samuel R. Bowman'}]\"}},\n",
       "   {'r': ({'citationCount': 162388,\n",
       "      'year': 2017.0,\n",
       "      'publication': 'Neural Information Processing Systems',\n",
       "      'referenceCount': 41,\n",
       "      'name': 'Attention is All you Need',\n",
       "      'abstract': 'The dominant sequence transduction models are based on complex recurrent or convolutional neural networks in an encoder-decoder configuration. The best performing models also connect the encoder and decoder through an attention mechanism. We propose a new simple network architecture, the Transformer, based solely on attention mechanisms, dispensing with recurrence and convolutions entirely. Experiments on two machine translation tasks show these models to be superior in quality while being more parallelizable and requiring significantly less time to train. Our model achieves 28.4 BLEU on the WMT 2014 English-to-German translation task, improving over the existing best results, including ensembles by over 2 BLEU. On the WMT 2014 English-to-French translation task, our model establishes a new single-model state-of-the-art BLEU score of 41.8 after training for 3.5 days on eight GPUs, a small fraction of the training costs of the best models from the literature. We show that the Transformer generalizes well to other tasks by applying it successfully to English constituency parsing both with large and limited training data.',\n",
       "      'paperId': '204e3073870fae3d05bcbc2f6a8e263d9b72e776',\n",
       "      'url': 'https://www.semanticscholar.org/paper/204e3073870fae3d05bcbc2f6a8e263d9b72e776',\n",
       "      'authors': nan},\n",
       "     'REF_BY',\n",
       "     {'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}),\n",
       "    'p': {'citationCount': 162388,\n",
       "     'year': 2017.0,\n",
       "     'publication': 'Neural Information Processing Systems',\n",
       "     'referenceCount': 41,\n",
       "     'name': 'Attention is All you Need',\n",
       "     'abstract': 'The dominant sequence transduction models are based on complex recurrent or convolutional neural networks in an encoder-decoder configuration. The best performing models also connect the encoder and decoder through an attention mechanism. We propose a new simple network architecture, the Transformer, based solely on attention mechanisms, dispensing with recurrence and convolutions entirely. Experiments on two machine translation tasks show these models to be superior in quality while being more parallelizable and requiring significantly less time to train. Our model achieves 28.4 BLEU on the WMT 2014 English-to-German translation task, improving over the existing best results, including ensembles by over 2 BLEU. On the WMT 2014 English-to-French translation task, our model establishes a new single-model state-of-the-art BLEU score of 41.8 after training for 3.5 days on eight GPUs, a small fraction of the training costs of the best models from the literature. We show that the Transformer generalizes well to other tasks by applying it successfully to English constituency parsing both with large and limited training data.',\n",
       "     'paperId': '204e3073870fae3d05bcbc2f6a8e263d9b72e776',\n",
       "     'url': 'https://www.semanticscholar.org/paper/204e3073870fae3d05bcbc2f6a8e263d9b72e776',\n",
       "     'authors': nan}},\n",
       "   {'r': ({'citationCount': 8951,\n",
       "      'year': 2016.0,\n",
       "      'publication': 'Conference on Empirical Methods in Natural Language Processing',\n",
       "      'referenceCount': 28,\n",
       "      'name': 'SQuAD: 100,000+ Questions for Machine Comprehension of Text',\n",
       "      'abstract': 'We present the Stanford Question Answering Dataset (SQuAD), a new reading comprehension dataset consisting of 100,000+ questions posed by crowdworkers on a set of Wikipedia articles, where the answer to each question is a segment of text from the corresponding reading passage. We analyze the dataset to understand the types of reasoning required to answer the questions, leaning heavily on dependency and constituency trees. We build a strong logistic regression model, which achieves an F1 score of 51.0%, a significant improvement over a simple baseline (20%). However, human performance (86.8%) is much higher, indicating that the dataset presents a good challenge problem for future research. \\nThe dataset is freely available at this https URL',\n",
       "      'paperId': '05dd7254b632376973f3a1b4d39485da17814df5',\n",
       "      'url': 'https://www.semanticscholar.org/paper/05dd7254b632376973f3a1b4d39485da17814df5',\n",
       "      'authors': nan},\n",
       "     'REF_BY',\n",
       "     {'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}),\n",
       "    'p': {'citationCount': 8951,\n",
       "     'year': 2016.0,\n",
       "     'publication': 'Conference on Empirical Methods in Natural Language Processing',\n",
       "     'referenceCount': 28,\n",
       "     'name': 'SQuAD: 100,000+ Questions for Machine Comprehension of Text',\n",
       "     'abstract': 'We present the Stanford Question Answering Dataset (SQuAD), a new reading comprehension dataset consisting of 100,000+ questions posed by crowdworkers on a set of Wikipedia articles, where the answer to each question is a segment of text from the corresponding reading passage. We analyze the dataset to understand the types of reasoning required to answer the questions, leaning heavily on dependency and constituency trees. We build a strong logistic regression model, which achieves an F1 score of 51.0%, a significant improvement over a simple baseline (20%). However, human performance (86.8%) is much higher, indicating that the dataset presents a good challenge problem for future research. \\nThe dataset is freely available at this https URL',\n",
       "     'paperId': '05dd7254b632376973f3a1b4d39485da17814df5',\n",
       "     'url': 'https://www.semanticscholar.org/paper/05dd7254b632376973f3a1b4d39485da17814df5',\n",
       "     'authors': nan}},\n",
       "   {'r': ({'citationCount': 3348,\n",
       "      'year': 2017.0,\n",
       "      'publication': 'Annual Meeting of the Association for Computational Linguistics',\n",
       "      'referenceCount': 38,\n",
       "      'name': 'TriviaQA: A Large Scale Distantly Supervised Challenge Dataset for Reading Comprehension',\n",
       "      'abstract': 'We present TriviaQA, a challenging reading comprehension dataset containing over 650K question-answer-evidence triples. TriviaQA includes 95K question-answer pairs authored by trivia enthusiasts and independently gathered evidence documents, six per question on average, that provide high quality distant supervision for answering the questions. We show that, in comparison to other recently introduced large-scale datasets, TriviaQA (1) has relatively complex, compositional questions, (2) has considerable syntactic and lexical variability between questions and corresponding answer-evidence sentences, and (3) requires more cross sentence reasoning to find answers. We also present two baseline algorithms: a feature-based classifier and a state-of-the-art neural network, that performs well on SQuAD reading comprehension. Neither approach comes close to human performance (23% and 40% vs. 80%), suggesting that TriviaQA is a challenging testbed that is worth significant future study.',\n",
       "      'paperId': 'f010affab57b5fcf1cd6be23df79d8ec98c7289c',\n",
       "      'url': 'https://www.semanticscholar.org/paper/f010affab57b5fcf1cd6be23df79d8ec98c7289c',\n",
       "      'authors': nan},\n",
       "     'REF_BY',\n",
       "     {'citationCount': 108712,\n",
       "      'year': 2019.0,\n",
       "      'publication': 'North American Chapter of the Association for Computational Linguistics',\n",
       "      'referenceCount': 63,\n",
       "      'name': 'BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding',\n",
       "      'abstract': 'We introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pre-train deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be fine-tuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial task-specific architecture modifications. BERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5 (7.7 point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).',\n",
       "      'paperId': 'df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'url': 'https://www.semanticscholar.org/paper/df2b0e26d0599ce3e70df8a9da02e51594e0e992',\n",
       "      'authors': \"[{'authorId': '39172707', 'name': 'Jacob Devlin'}, {'authorId': '1744179', 'name': 'Ming-Wei Chang'}, {'authorId': '2544107', 'name': 'Kenton Lee'}, {'authorId': '3259253', 'name': 'Kristina Toutanova'}]\"}),\n",
       "    'p': {'citationCount': 3348,\n",
       "     'year': 2017.0,\n",
       "     'publication': 'Annual Meeting of the Association for Computational Linguistics',\n",
       "     'referenceCount': 38,\n",
       "     'name': 'TriviaQA: A Large Scale Distantly Supervised Challenge Dataset for Reading Comprehension',\n",
       "     'abstract': 'We present TriviaQA, a challenging reading comprehension dataset containing over 650K question-answer-evidence triples. TriviaQA includes 95K question-answer pairs authored by trivia enthusiasts and independently gathered evidence documents, six per question on average, that provide high quality distant supervision for answering the questions. We show that, in comparison to other recently introduced large-scale datasets, TriviaQA (1) has relatively complex, compositional questions, (2) has considerable syntactic and lexical variability between questions and corresponding answer-evidence sentences, and (3) requires more cross sentence reasoning to find answers. We also present two baseline algorithms: a feature-based classifier and a state-of-the-art neural network, that performs well on SQuAD reading comprehension. Neither approach comes close to human performance (23% and 40% vs. 80%), suggesting that TriviaQA is a challenging testbed that is worth significant future study.',\n",
       "     'paperId': 'f010affab57b5fcf1cd6be23df79d8ec98c7289c',\n",
       "     'url': 'https://www.semanticscholar.org/paper/f010affab57b5fcf1cd6be23df79d8ec98c7289c',\n",
       "     'authors': nan}}]}]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 최종\n",
    "\n",
    "paper_name = BERT[\"paper_name\"]\n",
    "concepts = BERT[\"paper_concepts\"]\n",
    "\n",
    "prereq_depth = 2\n",
    "ref_limit = 30\n",
    "kw_paper_limit = 50\n",
    "\n",
    "# strength thresholds (없애고 싶으면 0.0으로)\n",
    "min_prereq_strength = 0.3\n",
    "min_kw_strength = 0.3   # ABOUT/IN strength용\n",
    "min_ref_strength = 0.0  # REF_BY strength용\n",
    "\n",
    "q = f\"\"\"\n",
    "// 0) 타겟 Paper\n",
    "MATCH (p:Paper {{name:$paper_name}})\n",
    "\n",
    "// 1) paper와 직접 연결된 Keyword (ABOUT/IN)\n",
    "OPTIONAL MATCH (p)-[pk:ABOUT|IN]-(k_paper:Keyword)\n",
    "WHERE pk.strength IS NULL OR pk.strength >= $min_kw_strength\n",
    "WITH p,\n",
    "     collect(DISTINCT {{k:k_paper, r:pk}}) AS paper_kw_links\n",
    "\n",
    "// 2) agent concepts로 매칭된 seed Keyword (name/alias, case-insensitive)\n",
    "WITH p, paper_kw_links, [c IN $concepts | toLower(c)] AS cs\n",
    "MATCH (k_seed:Keyword)\n",
    "WHERE toLower(k_seed.name) IN cs\n",
    "   OR ANY(a IN coalesce(k_seed.alias, []) WHERE toLower(a) IN cs)\n",
    "WITH p, paper_kw_links, collect(DISTINCT k_seed) AS seeds\n",
    "\n",
    "// 3) seed 주변: prereq (depth 제한) - path로 수집\n",
    "UNWIND seeds AS s\n",
    "OPTIONAL MATCH prereqPath = (kpre:Keyword)-[pr:PREREQ*1..{prereq_depth}]->(s)\n",
    "WHERE ALL(x IN relationships(prereqPath) WHERE x.strength IS NULL OR x.strength >= $min_prereq_strength)\n",
    "WITH p, paper_kw_links, seeds,\n",
    "     collect(DISTINCT prereqPath) AS prereq_paths\n",
    "\n",
    "// 4) seed를 ABOUT한 논문들 (limit)\n",
    "UNWIND seeds AS s2\n",
    "OPTIONAL MATCH (p_about:Paper)-[ab:ABOUT]->(s2)\n",
    "WHERE ab.strength IS NULL OR ab.strength >= $min_kw_strength\n",
    "WITH p, paper_kw_links, seeds, prereq_paths,\n",
    "     collect(DISTINCT {{p:p_about, r:ab, k:s2}})[0..$kw_paper_limit] AS seed_about_links\n",
    "\n",
    "// 5) 타겟 논문이 참고한 ref 논문들 (limit)\n",
    "OPTIONAL MATCH (ref:Paper)-[rr:REF_BY]->(p)\n",
    "WHERE rr.strength IS NULL OR rr.strength >= $min_ref_strength\n",
    "WITH p, paper_kw_links, seeds, prereq_paths, seed_about_links,\n",
    "     collect(DISTINCT {{p:ref, r:rr}})[0..$ref_limit] AS ref_links\n",
    "\n",
    "RETURN\n",
    "  p AS target_paper,\n",
    "  paper_kw_links,\n",
    "  seeds AS matched_keywords,\n",
    "  prereq_paths,\n",
    "  seed_about_links,\n",
    "  ref_links\n",
    "\"\"\"\n",
    "\n",
    "run_cypher(q, {\n",
    "    \"paper_name\": paper_name,\n",
    "    \"concepts\": concepts,\n",
    "    \"min_prereq_strength\": min_prereq_strength,\n",
    "    \"min_kw_strength\": min_kw_strength,\n",
    "    \"min_ref_strength\": min_ref_strength,\n",
    "    \"ref_limit\": ref_limit,\n",
    "    \"kw_paper_limit\": kw_paper_limit,\n",
    "})\n",
    "\n",
    "\n",
    "# target_paper : Paper 노드 1개\n",
    "# paper_kw_links : [{k: Keyword노드, r: ABOUT/IN관계}, ...]\n",
    "# matched_keywords : [Keyword노드, Keyword노드, ...] (seed 목록)\n",
    "# prereq_paths : [Path, Path, ...] (PREREQ 경로 리스트)\n",
    "# seed_about_links : [{p: Paper노드, r: ABOUT관계, k: seedKeyword노드}, ...]\n",
    "# ref_links : [{p: refPaper노드, r: REF_BY관계}, ...]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "907baf99",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "PTMT-GraphDB",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.19"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
